&Опция(Имя = "d data", Описание = "Расположение рабочей области 1C:EDT")
Перем КаталогРабочейОбласти; // Каталог workspace

&Опция(Имя = "p project", Описание = "Путь к каталогу проекта 1C:EDT, который нужно выгрузить")
Перем КаталогПроекта; // Каталог проекта, в котором находится файл .project

&Опция(Имя = "ep export-path", Описание = "Каталог, в который следует выгрузить файлы проекта")
Перем КаталогВыгрузки; // Каталог выгрузки

&Пластилин Перем МенеджерКонсолиЕДТ; // Менеджер консоли EDT

&КомандаПриложения(Имя = "export", Описание = "Выгрузить проект EDT в файлы XML")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВыгрузитьПроектВФайлы() Экспорт

	МенеджерКонсолиЕДТ.ВыгрузитьПроектВФайлы(КаталогРабочейОбласти, КаталогПроекта, КаталогВыгрузки);
	
КонецПроцедуры