#Использовать asserts

// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:Typo-off

&Логгер Перем Лог; // Управление логированием
&Пластилин Перем МенеджерКонфигуратора; // Управление конфигуратором
&Пластилин Перем МенеджерРепозиторияПроекта; // Управление репозиторием Git
&Пластилин Перем ПостроительНастроекСлияния; // Построитель файла настроек слияния

Перем РабочийКаталог; // Текущий рабочий каталог
Перем ИмяРасширения; // Имя расширения
Перем ВременныеФайлы; // Управление временными файлами
Перем ВременныйКаталогВПроекте; // Временный каталог внутри проекта
Перем СообщениеКоммита; // Сообщение коммита

Перем _НастройкиХранилища; // Настройки хранилища конфигурации

&Опция(Имя = "h hash", Описание = "Идентификатор родительского коммита")
&Обязательный
Перем КоммитПредка; // Идентификатор родительского коммита, по отношению к коммиту HEAD

&Опция(Имя = "m message", Описание = "Сообщение коммита")
Перем СообщениеКоммитаОпция; // Сообщение коммита из опции

&Опция(Имя = "message-stdin", Описание = "Сообщение коммита из потока ввода")
&Флаг
Перем СообщениеКоммитаИзПотокаВвода; // Булево. Признак получения сообщения коммита из stdin

&ПодкомандаПриложения(Имя = "push", Описание = "Отправить коммит в хранилище")
Процедура ПриСозданииОбъекта(
	&Пластилин НастройкиПриложения,
	&Деталька("Хранилище") НастройкиХранилища)

	РабочийКаталог = НастройкиПриложения.РабочийКаталог();
	ИмяРасширения = НастройкиПриложения.ИмяРасширения();
	ВременныеФайлы = НастройкиПриложения.ВременныеФайлы();
	ВременныйКаталогВПроекте = НастройкиПриложения.ВременныйКаталогВПроекте();

	_НастройкиХранилища = НастройкиХранилища;

КонецПроцедуры

&ВыполнениеКоманды
Процедура ОтправитьВХранилище() Экспорт

	МенеджерРепозиторияПроекта.ВывестиТекущееРасположение();

	Ожидаем.Что(МенеджерРепозиторияПроекта.НаличиеНезафиксированныхИзменений(),
		"Существуют несохраненные изменения. Выполните commit изменений или спрячьте изменения в stash")
		.Равно(Ложь);

	ОпределитьСообщениеКоммита();
	НормализоватьСообщениеКоммита();

	КоммитHead = МенеджерРепозиторияПроекта.ИдентификаторКоммитаHead();

	ФайлКонфигурации = НайтиФайлКонфигурацииПриложения(КоммитHead);

	Если ЗначениеЗаполнено(ИмяРасширения) Тогда
		МенеджерКонфигуратора.УстановитьФайлРасширения(ФайлКонфигурации);
	КонецЕсли;

	МенеджерКонфигуратора.ИнициализироватьСКонтекстом();

	ПроверитьАктуальностьВерсииХранилища();

	Лог.Информация("Начинаю отправку изменений в хранилище...");

	ИзмененныеОбъекты = ИзмененныеОбъектыV8(КоммитHead, КоммитПредка);

	СписокОбъектов = ПостроительНастроекСлияния.СоздатьСписокОбъектовДляЗахвата(ИзмененныеОбъекты);
	Если СписокОбъектов = Неопределено Тогда
		Убраться();
		Возврат;
	КонецЕсли;

	НастройкиСлияния = ПостроительНастроекСлияния.СоздатьФайлНастроекСлияния(ИзмененныеОбъекты);

	Попытка

		ОтправитьИзмененияВХранилище(СписокОбъектов, НастройкиСлияния, ФайлКонфигурации, ИзмененныеОбъекты);

	Исключение

		ОтменитьЗахватОбъектовВХранилище();
		Убраться();

		ВызватьИсключение;
		
	КонецПопытки;

	Убраться();

	Лог.Информация("Выполнена отправка коммита в хранилище");

КонецПроцедуры

Процедура ПроверитьАктуальностьВерсииХранилища()

	ТекущаяВерсияХранилища = ПрочитатьТекущуюВерсиюХранилища();
	ТекущаяВерсияХранилищаВГите = МенеджерРепозиторияПроекта.ТекущаяВерсияХранилища();

	ВерсииСовпадают = ТекущаяВерсияХранилища = ТекущаяВерсияХранилищаВГите;
	РезультатСравнения = ?(ВерсииСовпадают, "совпадают", "отличаются");

	Лог.Информация("%1/%2 (Версия/Версия в Git) - версии %3",
		ТекущаяВерсияХранилища, ТекущаяВерсияХранилищаВГите, ВРег(РезультатСравнения));

	Ожидаем.Что(ВерсииСовпадают,
		"Версия хранилища в Git не совпадает с текущей версией хранилища. Требуется актуализация ветки хранилища.")
		.Равно(Истина);

КонецПроцедуры

Функция ПрочитатьТекущуюВерсиюХранилища()

	ПутьКХранилищу = _НастройкиХранилища["Путь"];

	Если МенеджерКонфигуратора.ЭтоФайловоеХранилище(ПутьКХранилищу) Тогда
		ЧтениеФайловойБазы = Новый ЧтениеФайловойБазы(ПутьКХранилищу);
		ТекущаяВерсия = ЧтениеФайловойБазы.ТекущаяВерсияХранилища();
	Иначе
		ТекущаяВерсия = МенеджерКонфигуратора.ТекущаяВерсияХранилища(ИмяРасширения);
	КонецЕсли;
	
	Возврат ТекущаяВерсия;

КонецФункции

Функция НайтиФайлКонфигурацииПриложения(Коммит)

	РасширениеФайла = "cf";
	Если ЗначениеЗаполнено(ИмяРасширения) Тогда
		РасширениеФайла = "cfe";
	КонецЕсли;

	ИмяФайла = СтрШаблон("%1.%2", Коммит, РасширениеФайла);
	ПутьКФайлуКонфигурации = ОбъединитьПути(РабочийКаталог, ВременныйКаталогВПроекте, ИмяФайла);

	ФайлКонфигурации = Новый Файл(ПутьКФайлуКонфигурации);

	Ожидаем.Что(ФайлКонфигурации.Существует(),
		СтрШаблон("Не найден файл конфигурации по коммиту %1", Коммит))
		.Равно(Истина);

	Возврат ФайлКонфигурации.ПолноеИмя;

КонецФункции

Процедура ОтправитьИзмененияВХранилище(СписокОбъектов, НастройкиСлияния, ФайлКонфигурации, ИзмененныеОбъекты)
	
	ПодключитьсяКХранилищу(ИмяРасширения);

	МенеджерКонфигуратора.ЗахватитьОбъектыВХранилище(СписокОбъектов, ИмяРасширения);

	ПроверитьФайлИнформацииПослеЗахватаОбъектов();

	ПроверитьАктуальностьВерсииХранилища(); // повторим проверку после захвата объектов

	ОбъединитьКонфигурациюХранилищаСФайлом(ФайлКонфигурации, НастройкиСлияния);
	ПовторитьОбъединениеКонфигурацииХранилищаСФайлом(ИзмененныеОбъекты, ФайлКонфигурации, НастройкиСлияния);

	СписокОбъектов = Неопределено; // помещаем изменения всех захваченных
	МенеджерКонфигуратора.ПоместитьИзмененияОбъектовВХранилище(
		СписокОбъектов, СообщениеКоммита, ИмяРасширения);

КонецПроцедуры

Процедура ПодключитьсяКХранилищу(ИмяРасширения)
	
	Если МенеджерКонфигуратора.ЭтоВременныйКонтекст() Тогда

		МенеджерКонфигуратора.ПодключитьсяКХранилищу(ИмяРасширения);

	КонецЕсли;

КонецПроцедуры

Процедура ОтключитьсяОтХранилища()

	Если МенеджерКонфигуратора.ЭтоВременныйКонтекст() Тогда

		МенеджерКонфигуратора.ОтключитьсяОтХранилища(ИмяРасширения);

	КонецЕсли;

КонецПроцедуры

Процедура ОбъединитьКонфигурациюХранилищаСФайлом(ФайлКонфигурации, НастройкиСлияния)
	
	ПоставитьНаПоддержку = Неопределено;
	ВключитьВОбъединениеОбъектыПоНеразрешеннымСсылкам = Ложь;
	Принудительно = Истина;

	МенеджерКонфигуратора.ОбъединитьКонфигурациюСФайлом(
		ФайлКонфигурации,
		НастройкиСлияния,
		ПоставитьНаПоддержку,
		ВключитьВОбъединениеОбъектыПоНеразрешеннымСсылкам,
		Принудительно,
		ИмяРасширения);

КонецПроцедуры

// Баг платформы со сложносоставным объектом ВнешнийИсточникДанных №60031903 (HL-1236232).
// https://regevent.1c.ru/sbo/tp/59167951-4eb9-11f1-81ac-0050569f2415/info/
// При первом объединении переносится только часть объекта, для переноса остатка необходимо повторить.
//
// Параметры:
//  ИзмененныеОбъекты - ТаблицаЗначений
//  ФайлКонфигурации - Строка
//  НастройкиСлияния - Строка
//
Процедура ПовторитьОбъединениеКонфигурацииХранилищаСФайлом(ИзмененныеОбъекты, ФайлКонфигурации, НастройкиСлияния)
	
	Повторить = Ложь;

	ИменаОбъектов = ИзмененныеОбъекты.ВыгрузитьКолонку("ПолноеИмяОбъекта");
	Для каждого ПолноеИмяОбъекта Из ИменаОбъектов Цикл
		Если СтрНачинаетсяС(ПолноеИмяОбъекта, "ExternalDataSource") Тогда
			Повторить = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Повторить Тогда
		ОбъединитьКонфигурациюХранилищаСФайлом(ФайлКонфигурации, НастройкиСлияния);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьФайлИнформацииПослеЗахватаОбъектов()
	
	ФайлИнформации = МенеджерКонфигуратора.ФайлИнформации();

	Файл = Новый Файл(ФайлИнформации);
	Если НЕ Файл.Существует() Тогда
		Лог.Отладка("Не найден файл с информацией о захвате объектов");
		Возврат;
	КонецЕсли;

	ТекстСборка = Новый Массив;

	Чтение = Новый ЧтениеТекста(Файл.ПолноеИмя);

	ТекущаяСтрока = Чтение.ПрочитатьСтроку();
	Пока ТекущаяСтрока <> Неопределено Цикл
		ТекстСборка.Добавить(ТекущаяСтрока);
		ТекущаяСтрока = Чтение.ПрочитатьСтроку();
	КонецЦикла;

	Чтение.Закрыть();

	Если НЕ ТекстСборка.Количество() Тогда
		Лог.Отладка("Файл с информацией о захвате объектов пуст");
		Возврат;
	КонецЕсли;

	Текст = СтрСоединить(ТекстСборка, Символы.ПС);
	Лог.Отладка("Информация о захвате объектов:
		|%1", Текст);

	КоличествоСтрокРезультата = 2; // Как минимум две - строка открытия и строка закрытия
	Ожидаем.Что(ТекстСборка.Количество() >= КоличествоСтрокРезультата,
		"Неожиданное содержание файла с информацией о захвате объектов")
		.Равно(Истина);

	ПерваяСтрока = СокрЛП(ТекстСборка[0]);
	Ожидаем.Что(ПерваяСтрока = "---- Начало операции с хранилищем конфигурации ----",
		"Есть замечания по захвату объектов")
		.Равно(Истина);

	ПоследняяСтрока = СокрЛП(ТекстСборка[ТекстСборка.ВГраница()]);
	Ожидаем.Что(ПоследняяСтрока = "Захват объектов в хранилище успешно завершен",
		"Есть замечания по захвату объектов")
		.Равно(Истина);

КонецПроцедуры

Процедура ОтменитьЗахватОбъектовВХранилище()
	
	Если МенеджерКонфигуратора.ОбъектыЗахвачены() Тогда

		СписокОбъектов = Неопределено; // отменяем захват всех захваченных
		МенеджерКонфигуратора.ОтменитьЗахватОбъектовВХранилище(СписокОбъектов, ИмяРасширения);

	КонецЕсли;

КонецПроцедуры

Функция ИзмененныеОбъектыV8(КоммитHead, КоммитПредка)
	
	ИзмененныеФайлы = МенеджерРепозиторияПроекта.ИзмененныеФайлыПоСтатусам(КоммитПредка, КоммитHead);

	ВключатьПустые = Ложь;
	ИзмененныеФайлы = СтрРазделить(ИзмененныеФайлы, Символы.ПС, ВключатьПустые);

	Возврат ПостроительНастроекСлияния.ИзмененныеОбъектыV8(ИзмененныеФайлы, КоммитПредка);

КонецФункции

Процедура ОпределитьСообщениеКоммита()
	
	Если НЕ ЗначениеЗаполнено(СообщениеКоммитаОпция)
		И НЕ ЗначениеЗаполнено(СообщениеКоммитаИзПотокаВвода) Тогда
		ВызватьИсключение "Не передано сообщение коммита";
	КонецЕсли;

	Если СообщениеКоммитаИзПотокаВвода = Истина Тогда
		ПотокВвода = Консоль.ОткрытьСтандартныйПотокВвода();
		ЧтениеТекста = Новый ЧтениеТекста(ПотокВвода);
		СообщениеКоммита = ЧтениеТекста.Прочитать();
	Иначе
		СообщениеКоммита = СообщениеКоммитаОпция;
	КонецЕсли;

	Если ПустаяСтрока(СообщениеКоммита) Тогда
		ВызватьИсключение "Не передано сообщение коммита";
	КонецЕсли;

КонецПроцедуры

// Экранирует кавычки в тексте сообщения
Процедура НормализоватьСообщениеКоммита()
	
	СообщениеКоммита = СтрЗаменить(СообщениеКоммита, """", """""");

КонецПроцедуры

Процедура Убраться()
	
	ОтключитьсяОтХранилища();

	МенеджерКонфигуратора.УдалитьВременнуюБазу();

	ВременныеФайлы.Удалить();

КонецПроцедуры