#Использовать asserts
#Использовать 1commands
#Использовать fs

&Логгер Перем Лог; // Управление логированием
&ЛоггерВнешний Перем ЛогВнешний; // Управление логированием внешних источников
&Пластилин Перем МенеджерРепозиторияПроекта; // Управление репозиторием Git

Перем НастройкиГитсинк; // Переменные среды gitsync
Перем НастройкиХранилища; // Настройки подключения к хранилищу конфигурации 1С
Перем ВременныеФайлы; // Управление временными файлами
Перем КаталогПроекта; // Каталог проекта
Перем ИмяПроекта; // Имя проекта
Перем ИмяБазовогоПроекта; // Имя базового проекта
Перем ИмяРасширения; // Имя расширения
Перем КореньРепозитория; // Каталог расположения папки .git

// Список путей к своим файлам/каталогам, находящимся внутри каталога проекта
// для сохранения их перед очисткой проекта при полном импорте (full dump) из хранилища
Перем ИсключениеПриОчисткеПроекта;

&ПодкомандаПриложения(Имя = "pull", Описание = "Получить изменения из хранилища")
Процедура ПриСозданииОбъекта(
	&Пластилин НастройкиПриложения,
	&Деталька("Gitsync") ПеременныеСредыГитсинк,
	&Деталька("Хранилище") Хранилище,
	&Деталька("ИсключениеПриОчисткеКаталогаПроекта") ИсключениеПриОчисткеКаталогаПроекта)

	ВременныеФайлы = НастройкиПриложения.ВременныеФайлы();
	КаталогПроекта = НастройкиПриложения.КаталогПроекта();
	ИмяПроекта = НастройкиПриложения.ИмяПроекта();
	ИмяБазовогоПроекта = НастройкиПриложения.ИмяБазовогоПроекта();
	ИмяРасширения = НастройкиПриложения.ИмяРасширения();

	НастройкиГитсинк = ПеременныеСредыГитсинк;
	НастройкиХранилища = Хранилище;
	ИсключениеПриОчисткеПроекта = ИсключениеПриОчисткеКаталогаПроекта;

КонецПроцедуры

&ВыполнениеКоманды
Процедура ПолучитьИзХранилища() Экспорт

	МенеджерРепозиторияПроекта.ВывестиТекущееРасположение();

	СохранитьФайлыПроекта();

	Попытка
		ПолучитьИзмененияИзХранилища();
	Исключение
		ВосстановитьФайлыПроекта();
		ВызватьИсключение;
	КонецПопытки;

	ВосстановитьФайлыПроекта();
	ВременныеФайлы.Удалить();

КонецПроцедуры

Процедура ПолучитьИзмененияИзХранилища()

	Ожидаем.Что(ЗначениеЗаполнено(НастройкиХранилища),
		"Не заполнены настройки хранилища")
		.Равно(Истина);

	Ожидаем.Что(МенеджерРепозиторияПроекта.НаличиеНезафиксированныхИзменений(),
		"Существуют несохраненные изменения. Выполните commit изменений или спрячьте изменения в stash")
		.Равно(Ложь);

	Лог.Информация("Начинаю получение изменений из хранилища...");

	МенеджерРепозиторияПроекта.ПереключитьсяНаВетку("master");
	Лог.Информация("Переключился на ветку master");

	СинхронизироватьРепозиторийСХранилищем();

	Лог.Информация("Выполнено получение изменений из хранилища");

КонецПроцедуры

Процедура СинхронизироватьРепозиторийСХранилищем()

	Команда = Новый Команда;
	Команда.УстановитьКоманду("gitsync");
	Команда.ДобавитьПараметр("sync");
	УстановитьПеременныеСредыГитсинк(Команда);
	Команда.ДобавитьЛогВыводаКоманды(ЛогВнешний);
	Команда.ПоказыватьВыводНемедленно(Ложь);
	КодВозврата = Команда.Исполнить();

	Ожидаем.Что(КодВозврата, "При синхронизации репозитория с хранилищем возникла ошибка").Равно(0);

КонецПроцедуры

Процедура УстановитьПеременныеСредыГитсинк(Команда)

	Переменные = Новый Соответствие;
	Переменные.Вставить("GITSYNC_PROJECT_NAME", ИмяПроекта);
	Переменные.Вставить("GITSYNC_WORKDIR", КаталогПроекта);
	Переменные.Вставить("GITSYNC_STORAGE_PATH", ФС.ПолныйПуть(НастройкиХранилища["Путь"]));
	Переменные.Вставить("GITSYNC_STORAGE_USER", НастройкиХранилища["Логин"]);
	Переменные.Вставить("GITSYNC_STORAGE_PASSWORD", НастройкиХранилища["Пароль"]);
	Переменные.Вставить("GITSYNC_TEMP", ВременныеФайлы.СоздатьКаталог());

	Если ЗначениеЗаполнено(ИмяРасширения) Тогда
		Переменные.Вставить("GITSYNC_EXTENSION", ИмяРасширения);
		Переменные.Вставить("GITSYNC_BASE_PROJECT_NAME", ИмяБазовогоПроекта);
	КонецЕсли;

	Если ЗначениеЗаполнено(НастройкиГитсинк) Тогда
		ДополнитьСоответствие(Переменные, НастройкиГитсинк);
	КонецЕсли;

	Команда.УстановитьПеременныеСреды(Переменные);

КонецПроцедуры

Процедура ДополнитьСоответствие(Приемник, Источник)

	Для Каждого КлючЗначение Из Источник Цикл
		Приемник.Вставить(ВРег(КлючЗначение.Ключ), КлючЗначение.Значение);
	КонецЦикла;

КонецПроцедуры

Процедура СохранитьФайлыПроекта()

	Если НЕ ЗначениеЗаполнено(ИсключениеПриОчисткеПроекта) Тогда
		Возврат;
	КонецЕсли;

	КаталогСохранения = ВременныйКаталогФайловПроекта();
	
	ФС.ОбеспечитьПустойКаталог(КаталогСохранения);

	Для каждого ИмяФайла Из ИсключениеПриОчисткеПроекта Цикл

		Файл = Новый Файл(ИмяФайла);

		Если НЕ Файл.Существует() Тогда
			Продолжить;
		КонецЕсли;

		Куда = ОбъединитьПути(КаталогСохранения, ИмяФайла);

		Если Файл.ЭтоКаталог() Тогда
			ФС.КопироватьСодержимоеКаталога(Файл.ПолноеИмя, Куда);
		Иначе
			КопироватьФайл(Файл.ПолноеИмя, Куда);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ВосстановитьФайлыПроекта()

	КаталогСохранения = ВременныйКаталогФайловПроекта();

	Файл = Новый Файл(КаталогСохранения);
	Если Файл.Существует() Тогда
		ФС.КопироватьСодержимоеКаталога(Файл.ПолноеИмя, КаталогПроекта);
	КонецЕсли;

	ВременныеФайлы.УдалитьФайл(ОбъединитьПути(КореньРепозитория(), ".projectfiles"));

КонецПроцедуры

Функция ВременныйКаталогФайловПроекта()
	
	Возврат ОбъединитьПути(КореньРепозитория(), ".projectfiles", ИмяПроекта);

КонецФункции

Функция КореньРепозитория()
	
	Если КореньРепозитория = Неопределено Тогда
		КореньРепозитория = ФС.ПолныйПуть(МенеджерРепозиторияПроекта.КореньРепозитория());
	КонецЕсли;

	Возврат КореньРепозитория;

КонецФункции