#Использовать asserts
#Использовать v8storage
#Использовать fs

&Логгер Перем Лог;
&Пластилин Перем МенеджерКонфигуратора;
Перем ВременныеФайлы;

&Опция(Имя = "o object", Описание = "Имя объекта метаданных для помещения в хранилище (например, Catalog.Номенклатура)")
Перем ИмяОбъекта;

&Опция(Имя = "m message", Описание = "Комментарий к помещаемой версии")
Перем Комментарий;

&ПодкомандаПриложения(Имя = "commit", Описание = "Поместить изменения объекта в хранилище конфигурации")
Процедура ПриСозданииОбъекта(&Пластилин НастройкиПриложения)
	
	ВременныеФайлы = НастройкиПриложения.ВременныеФайлы();
	
КонецПроцедуры

&ВыполнениеКоманды
Процедура ПоместитьВХранилище() Экспорт
	
	Если ПустаяСтрока(ИмяОбъекта) Тогда
		ВызватьИсключение "Необходимо указать объект (-o) для помещения в хранилище. Пример: -o Catalog.Номенклатура";
	КонецЕсли;
	
	Если ПустаяСтрока(Комментарий) Тогда
		ВызватьИсключение "Необходимо указать комментарий (-m). Пример: -m ""Добавлен новый реквизит""";
	КонецЕсли;

	Лог.Информация("Попытка помещения объекта %1 в хранилище...", ИмяОбъекта);
	
	МенеджерКонфигуратора.ИнициализироватьСКонтекстом();
	
	// Формирование XML списка для пакетного режима
	Список = Новый СписокОбъектовКонфигурации();
	ВключатьПодчиненные = Ложь;
	Список.ДобавитьОбъектКонфигурации(ИмяОбъекта, ВключатьПодчиненные, "");
	
	ФайлСписка = ВременныеФайлы.НовоеИмяФайла("xml");
	Список.ЗаписатьФайлОбъектов(ФайлСписка);
	
	Попытка
		МенеджерКонфигуратора.ПодключитьсяКХранилищу();
		МенеджерКонфигуратора.ПоместитьИзмененияОбъектовВХранилище(ФайлСписка, Комментарий);
		
		// Проверка успешности по логу Конфигуратора
		ПроверитьФайлИнформацииПослеПомещенияОбъектов();
		
		Лог.Информация("Объект %1 успешно помещен в хранилище.", ИмяОбъекта);
	Исключение
		Лог.Ошибка("Не удалось поместить объект в хранилище. Возможно, он не был захвачен.");
		ОтключитьсяОтХранилища();
		ВызватьИсключение;
	КонецПопытки;
	
	ОтключитьсяОтХранилища();
	
КонецПроцедуры

Процедура ПроверитьФайлИнформацииПослеПомещенияОбъектов()
	
	ФайлИнформации = МенеджерКонфигуратора.ФайлИнформации();
	Файл = Новый Файл(ФайлИнформации);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;

	Чтение = Новый ЧтениеТекста(Файл.ПолноеИмя);
	Текст = Чтение.Прочитать();
	Чтение.Закрыть();
	
	// Ищем подстроку без учета регистра
	Если Найти(НРег(Текст), "успешно завершен") = 0 Тогда
		Лог.Ошибка("Детали из лога конфигуратора: %1", Текст);
		ВызватьИсключение "Ошибка при помещении объекта по логу конфигуратора.";
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтключитьсяОтХранилища()
	
	Если МенеджерКонфигуратора.ЭтоВременныйКонтекст() Тогда
		МенеджерКонфигуратора.ОтключитьсяОтХранилища();
	КонецЕсли;
	
КонецПроцедуры
