#Использовать asserts
#Использовать 1commands
#Использовать gitrunner
#Использовать v8runner
#Использовать fs
#Использовать tempfiles

Перем ПутьFixture;
Перем ПутьКПриложению;
Перем ПутьКХранилищу;
Перем ХранилищеЛогин;
Перем КаталогTests;

&ПередВсеми
Процедура ИнициализироватьВсе() Экспорт

	КаталогTests = ФС.ПолныйПуть("./tests");

	ПутьFixture = ПутьFixture();

	ХранилищеОригинал = ОбъединитьПути(ПутьFixture, "storage_origin");
	ХранилищеОригиналНовоеРасположение = ОбъединитьПути(КаталогTests, "storage");
	ФС.КопироватьСодержимоеКаталога(ХранилищеОригинал, ХранилищеОригиналНовоеРасположение);

	ПроектОригинал = ОбъединитьПути(ПутьFixture, "repo");
	ПроектОригиналНовоеРасположение = ОбъединитьПути(КаталогTests, "repo");
	ФС.КопироватьСодержимоеКаталога(ПроектОригинал, ПроектОригиналНовоеРасположение);

	РабочийКаталог = ОбъединитьПути(ПроектОригиналНовоеРасположение, "test");
	УстановитьТекущийКаталог(РабочийКаталог);

КонецПроцедуры

&ПередКаждым
Процедура Инициализировать() Экспорт

	КаталогTests = ФС.ПолныйПуть("../../../tests");

	ПутьFixture = ПутьFixture();
	ПутьКПриложению = ФС.ПолныйПуть("../../../src/main.os");
	ПутьКХранилищу = ПутьКХранилищу();
	ХранилищеЛогин = "Тест";

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("feature/issue-2", "e7b96bca0ed54485d04ef2305e7c8b98951e078e", "Добавлены объекты каждого типа")
&ОтображаемоеИмя("Добавить объекты каждого типа")
Процедура ДобавитьОбъектыКаждогоТипа(ИмяВетки, КоммитаПредка, СообщениеКоммита) Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("КоммитВетки", "a9f519f90fd248dc7b4e99c43426026235231e1b");
	Параметры.Вставить("ИмяВетки", ИмяВетки);
	Параметры.Вставить("СообщениеКоммита", СообщениеКоммита);
	Параметры.Вставить("КоммитаПредка", КоммитаПредка);

	ПроверитьКомандуОтправкиВХранилище(Параметры);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("feature/issue-3", "36c82509e282ee961e6ba8e78a92d4c02ba09f5c", "Изменены добавленные объекты")
&ОтображаемоеИмя("Изменить добавленные объекты")
Процедура ИзменитьДобавленныеОбъекты(ИмяВетки, КоммитаПредка, СообщениеКоммита) Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("КоммитВетки", "dd88ac2660f33e49797413518e2d0bbd5e3d7d06");
	Параметры.Вставить("ИмяВетки", ИмяВетки);
	Параметры.Вставить("СообщениеКоммита", СообщениеКоммита);
	Параметры.Вставить("КоммитаПредка", КоммитаПредка);

	ПроверитьКомандуОтправкиВХранилище(Параметры);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("feature/issue-4", "4930f5c56c7868b23d1fe41d681e7528d3606308", "Удалены добавленные объекты")
&ОтображаемоеИмя("Удалить добавленные объекты")
Процедура УдалитьДобавленныеОбъекты(ИмяВетки, КоммитаПредка, СообщениеКоммита) Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("КоммитВетки", "12c9bb4c685e75f619d2828879a0f73525fc90ef");
	Параметры.Вставить("ИмяВетки", ИмяВетки);
	Параметры.Вставить("СообщениеКоммита", СообщениеКоммита);
	Параметры.Вставить("КоммитаПредка", КоммитаПредка);

	ПроверитьКомандуОтправкиВХранилище(Параметры);

КонецПроцедуры

&ПослеКаждого
Процедура Завершение() Экспорт

	ВременныеФайлы.Удалить();

КонецПроцедуры

&ПослеВсех
Процедура ЗавершениеВсех() Экспорт

	КаталогTests = ФС.ПолныйПуть("../../../");
	УстановитьТекущийКаталог(КаталогTests);

	ВременныеФайлы.УдалитьФайл(ОбъединитьПути(ТекущийКаталог(), "tests", "storage"));
	ВременныеФайлы.УдалитьФайл(ОбъединитьПути(ТекущийКаталог(), "tests", "repo"));

	ВременныеФайлы.УдалитьФайл(ВременныеФайлы.БазовыйКаталог);

КонецПроцедуры

Процедура ПроверитьКомандуОтправкиВХранилище(Параметры)
	
	// Дано

	КоммитВетки = Параметры.КоммитВетки;
	ФайлКонфигурации = КоммитВетки + ".cf";
	КонфигурацияСливаемаяВХранилище = ОбъединитьПути(ПутьFixture, ФайлКонфигурации);
	КаталогАртефактов = ОбъединитьПути(ТекущийКаталог(), ".v8storagesync");
	ФС.ОбеспечитьПустойКаталог(КаталогАртефактов);
	КонфигурацияСливаемаяВХранилищеНовоеРасположение = ОбъединитьПути(КаталогАртефактов, ФайлКонфигурации);
	КопироватьФайл(КонфигурацияСливаемаяВХранилище, КонфигурацияСливаемаяВХранилищеНовоеРасположение);

	Гит = Новый ГитРепозиторий();
	Гит.УстановитьРабочийКаталог(ТекущийКаталог());
	Гит.ПерейтиВВетку(Параметры.ИмяВетки);

	// Когда

	Команда = Новый Команда;
	Команда.УстановитьКоманду("oscript");
	Команда.ДобавитьПараметр(ПутьКПриложению);
	Команда.ДобавитьПараметр("v8storage");
	Команда.ДобавитьПараметр("push");
	Команда.ДобавитьПараметр("-m");
	Команда.ДобавитьПараметр(Команда.ОбернутьВКавычки(Параметры.СообщениеКоммита));
	Команда.ДобавитьПараметр("-h");
	Команда.ДобавитьПараметр(Команда.ОбернутьВКавычки(Параметры.КоммитаПредка));
	Команда.ПоказыватьВыводНемедленно(Ложь);
	КодВозврата = Команда.Исполнить();
	Сообщить(Команда.ПолучитьВывод());
	Ожидаем.Что(КодВозврата).Равно(0);

	// Тогда

	Конфигуратор = Новый УправлениеКонфигуратором();

	ИгнорироватьНаличиеПодключеннойБД = Истина;
	ЗаменитьКонфигурациюБД = Истина;
	ИмяРасширения = Неопределено;

	Конфигуратор.ПодключитьсяКХранилищу(
		ПутьКХранилищу,
		ХранилищеЛогин,
		"",
		ИгнорироватьНаличиеПодключеннойБД,
		ЗаменитьКонфигурациюБД,
		ИмяРасширения);

	Конфигуратор.ЗагрузитьКонфигурациюИзХранилища(
		ПутьКХранилищу,
		ХранилищеЛогин);

	ФайлКонфигурацииХранилища = ВременныеФайлы.НовоеИмяФайла("cf");
	Конфигуратор.ВыгрузитьКонфигурациюВФайл(ФайлКонфигурацииХранилища);

	ПутьКОтчету = ВременныеФайлы.НовоеИмяФайла("txt");
	ФорматОтчета = "txt";
	ИмяРасширения = Неопределено;

	Конфигуратор.ПолучитьОтчетОСравненииКонфигурацииСФайлом(
		ФайлКонфигурацииХранилища,
		ПутьКОтчету,
		ТипыОтчетовОСравнении.Краткий,
		ФорматОтчета,
		ИмяРасширения,
		КонфигурацияСливаемаяВХранилище);

	Конфигуратор.УдалитьВременнуюБазу();

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКОтчету);
	ТекстОтчета = СокрЛП(ЧтениеТекста.Прочитать());
	ЧтениеТекста.Закрыть();

	ФайлОтчета = КоммитВетки + ".txt";
	ПутьКОтчетуЭталон = ОбъединитьПути(ПутьFixture, ФайлОтчета);
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКОтчетуЭталон);
	ТекстОтчетаЭталон = СокрЛП(ЧтениеТекста.Прочитать());
	ЧтениеТекста.Закрыть();

	Утверждения.ПроверитьРавенство(ТекстОтчета, ТекстОтчетаЭталон);

КонецПроцедуры

Функция ПутьFixture()
	
	Возврат ОбъединитьПути(КаталогTests, "fixture");

КонецФункции

Функция ПутьКХранилищу()
	
	Возврат ОбъединитьПути(КаталогTests, "storage");

КонецФункции