#Использовать asserts
#Использовать 1commands
#Использовать gitrunner
#Использовать v8runner
#Использовать fs
#Использовать tempfiles

Перем ПутьFixture;
Перем ПутьКПриложению;
Перем ПутьКХранилищу;
Перем ХранилищеЛогин;
Перем КаталогTests;
Перем ИмяРасширения;

&ПередВсеми
Процедура ИнициализироватьВсе() Экспорт

	КаталогTests = ФС.ПолныйПуть("./tests");

	ПутьFixture = ПутьFixture();

	ХранилищеОригинал = ОбъединитьПути(ПутьFixture, "storage_ext_origin");
	ХранилищеОригиналНовоеРасположение = ОбъединитьПути(КаталогTests, "storage_ext");
	ФС.КопироватьСодержимоеКаталога(ХранилищеОригинал, ХранилищеОригиналНовоеРасположение);

	ПроектОригинал = ОбъединитьПути(ПутьFixture, "repo_ext");
	ПроектОригиналНовоеРасположение = ОбъединитьПути(КаталогTests, "repo_ext");
	ФС.КопироватьСодержимоеКаталога(ПроектОригинал, ПроектОригиналНовоеРасположение);

	БазаПодключеннаяКХранилищуОригинал = ОбъединитьПути(ПутьFixture, "base_ext");
	БазаПодключеннаяКХранилищуОригиналНовоеРасположение = ОбъединитьПути(КаталогTests, "base_ext");
	ФС.КопироватьСодержимоеКаталога(БазаПодключеннаяКХранилищуОригинал, БазаПодключеннаяКХранилищуОригиналНовоеРасположение);

	РабочийКаталог = ОбъединитьПути(ПроектОригиналНовоеРасположение, "test.ext");
	УстановитьТекущийКаталог(РабочийКаталог);

КонецПроцедуры

&ПередКаждым
Процедура Инициализировать() Экспорт

	КаталогTests = ФС.ПолныйПуть("../../../tests");

	ПутьFixture = ПутьFixture();
	ПутьКПриложению = ФС.ПолныйПуть("../../../src/main.os");
	ПутьКХранилищу = ПутьКХранилищу();
	ХранилищеЛогин = "Тест";
	ИмяРасширения = "ext";

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("feature/issue-1", "f395bad8c712f80fd10750f57a1eeeff9a48f67e", "Добавлены заимствованные и новые объекты")
&ОтображаемоеИмя("Добавить заимствованные и новые объекты")
Процедура ДобавитьЗаимствованныеИНовыеОбъекты(ИмяВетки, КоммитаПредка, СообщениеКоммита) Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("КоммитВетки", "da13f58285d3fcae0bd5e3981bc1ebc1d74508e6");
	Параметры.Вставить("ИмяВетки", ИмяВетки);
	Параметры.Вставить("СообщениеКоммита", СообщениеКоммита);
	Параметры.Вставить("КоммитаПредка", КоммитаПредка);

	ПроверитьКомандуОтправкиВХранилище(Параметры);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("feature/issue-2", "b2ccfc9e4f77f73f545b359179c704911ab37b82", "Изменены заимствованные и новые объекты")
&ОтображаемоеИмя("Изменить заимствованные и новые объекты")
Процедура ИзменитьЗаимствованныеИНовыеОбъекты(ИмяВетки, КоммитаПредка, СообщениеКоммита) Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("КоммитВетки", "e27b542c5b46a681a00c1317706fc01b83789564");
	Параметры.Вставить("ИмяВетки", ИмяВетки);
	Параметры.Вставить("СообщениеКоммита", СообщениеКоммита);
	Параметры.Вставить("КоммитаПредка", КоммитаПредка);

	ПроверитьКомандуОтправкиВХранилище(Параметры);

КонецПроцедуры

&ПараметризованныйТест
&ИсточникЗначение("feature/issue-3", "6b9ad8a0966952207944ccb7231d46ac958f0abc", "Удалены заимствованные и новые объекты")
&ОтображаемоеИмя("Удалить заимствованные и новые объекты")
Процедура УдалитьЗаимствованныеИНовыеОбъекты(ИмяВетки, КоммитаПредка, СообщениеКоммита) Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("КоммитВетки", "ac0d04f518da57636ba5ae3290c9927cf8af07f1");
	Параметры.Вставить("ИмяВетки", ИмяВетки);
	Параметры.Вставить("СообщениеКоммита", СообщениеКоммита);
	Параметры.Вставить("КоммитаПредка", КоммитаПредка);

	ПроверитьКомандуОтправкиВХранилище(Параметры);

КонецПроцедуры

&ПослеКаждого
Процедура Завершение() Экспорт

	ВременныеФайлы.Удалить();

КонецПроцедуры

&ПослеВсех
Процедура ЗавершениеВсех() Экспорт

	КаталогTests = ФС.ПолныйПуть("../../../");
	УстановитьТекущийКаталог(КаталогTests);

	ВременныеФайлы.УдалитьФайл(ОбъединитьПути(ТекущийКаталог(), "tests", "storage_ext"));
	ВременныеФайлы.УдалитьФайл(ОбъединитьПути(ТекущийКаталог(), "tests", "repo_ext"));
	ВременныеФайлы.УдалитьФайл(ОбъединитьПути(ТекущийКаталог(), "tests", "base_ext"));

	ВременныеФайлы.УдалитьФайл(ВременныеФайлы.БазовыйКаталог);

КонецПроцедуры

Процедура ПроверитьКомандуОтправкиВХранилище(Параметры)
	
	// Дано

	КоммитВетки = Параметры.КоммитВетки;
	ФайлКонфигурации = КоммитВетки + ".cfe";
	КонфигурацияСливаемаяВХранилище = ОбъединитьПути(ПутьFixture, ФайлКонфигурации);
	КаталогАртефактов = ОбъединитьПути(ТекущийКаталог(), ".v8storagesync");
	ФС.ОбеспечитьПустойКаталог(КаталогАртефактов);
	КонфигурацияСливаемаяВХранилищеНовоеРасположение = ОбъединитьПути(КаталогАртефактов, ФайлКонфигурации);
	КопироватьФайл(КонфигурацияСливаемаяВХранилище, КонфигурацияСливаемаяВХранилищеНовоеРасположение);

	Гит = Новый ГитРепозиторий();
	Гит.УстановитьРабочийКаталог(ТекущийКаталог());
	Гит.ПерейтиВВетку(Параметры.ИмяВетки);

	// Подключить расширение к хранилищу
	Конфигуратор = Новый УправлениеКонфигуратором();
	СтрокаСоединения = Конфигуратор.ПараметрыСтрокиСоединения();
	СтрокаСоединения.Вставить("ПутьКФайлуБазы", ПутьКБазе());
	Конфигуратор.УстановитьКонтекст(СтрокаСоединения, "", "");
	Конфигуратор.ПодключитьсяКХранилищу(
		ПутьКХранилищу,
		ХранилищеЛогин,
		"",
		Истина,
		Истина,
		ИмяРасширения);

	// Когда

	Команда = Новый Команда;
	Команда.УстановитьКоманду("oscript");
	Команда.ДобавитьПараметр(ПутьКПриложению);
	Команда.ДобавитьПараметр("v8storage");
	Команда.ДобавитьПараметр("push");
	Команда.ДобавитьПараметр("-m");
	Команда.ДобавитьПараметр(Команда.ОбернутьВКавычки(Параметры.СообщениеКоммита));
	Команда.ДобавитьПараметр("-h");
	Команда.ДобавитьПараметр(Команда.ОбернутьВКавычки(Параметры.КоммитаПредка));
	Команда.ПоказыватьВыводНемедленно(Ложь);
	КодВозврата = Команда.Исполнить();
	Сообщить(Команда.ПолучитьВывод());
	Ожидаем.Что(КодВозврата).Равно(0);

	// Тогда

	Конфигуратор = Новый УправлениеКонфигуратором();
	СтрокаСоединения = Конфигуратор.ПараметрыСтрокиСоединения();
	СтрокаСоединения.Вставить("ПутьКФайлуБазы", ПутьКБазе());
	Конфигуратор.УстановитьКонтекст(СтрокаСоединения, "", "");

	ИгнорироватьНаличиеПодключеннойБД = Истина;
	ЗаменитьКонфигурациюБД = Истина;
	ХранилищеПароль = "";
	Конфигуратор.ПодключитьсяКХранилищу(
		ПутьКХранилищу,
		ХранилищеЛогин,
		ХранилищеПароль,
		ИгнорироватьНаличиеПодключеннойБД,
		ЗаменитьКонфигурациюБД,
		ИмяРасширения);

	ФайлКонфигурацииХранилища = ВременныеФайлы.НовоеИмяФайла("cfe");
	Конфигуратор.ВыгрузитьРасширениеВФайл(ФайлКонфигурацииХранилища, ИмяРасширения);

	ПутьКОтчету = ВременныеФайлы.НовоеИмяФайла("txt");
	ФорматОтчета = "txt";

	Конфигуратор.ПолучитьОтчетОСравненииКонфигурацииСФайлом(
		ФайлКонфигурацииХранилища,
		ПутьКОтчету,
		ТипыОтчетовОСравнении.Краткий,
		ФорматОтчета,
		ИмяРасширения,
		КонфигурацияСливаемаяВХранилище);

	Конфигуратор.УдалитьВременнуюБазу();

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКОтчету);
	ТекстОтчета = СокрЛП(ЧтениеТекста.Прочитать());
	ЧтениеТекста.Закрыть();

	ФайлОтчета = КоммитВетки + ".txt";
	ПутьКОтчетуЭталон = ОбъединитьПути(ПутьFixture, ФайлОтчета);
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКОтчетуЭталон);
	ТекстОтчетаЭталон = СокрЛП(ЧтениеТекста.Прочитать());
	ЧтениеТекста.Закрыть();

	Утверждения.ПроверитьРавенство(ТекстОтчета, ТекстОтчетаЭталон);

КонецПроцедуры

Функция ПутьКБазе()
	
	Возврат ОбъединитьПути(КаталогTests, "base_ext");

КонецФункции

Функция ПутьFixture()
	
	Возврат ОбъединитьПути(КаталогTests, "fixture");

КонецФункции

Функция ПутьКХранилищу()
	
	Возврат ОбъединитьПути(КаталогTests, "storage_ext");

КонецФункции