#Использовать v8runner
#Использовать fs

&Логгер Перем Лог; // Управление логированием

Перем _БазаПодключеннаяКХранилищу; // Настройки подключения к разработческой базе, подключенной к хранилищу
Перем _НастройкиХранилища; // Настройки подключения к хранилищу конфигурации
Перем Конфигуратор; // Управление конфигуратором
Перем ВременныеФайлы; // Управление временными файлами
Перем ФайлИнформации; // Путь к файлу с информацией, выводимой по ключу /out
Перем ВременныйКонтекст; // Признак использования временного контекста
Перем ПодключенКХранилищу; // Признак успешного подключения к хранилищу
Перем ОбъектыЗахвачены; // Признак успешного захвата объектов в хранилище

&Желудь
Процедура ПриСозданииОбъекта(
	&Пластилин НастройкиПриложения,
	&Деталька("БазаПодключеннаяКХранилищу") БазаПодключеннаяКХранилищу,
	&Деталька("Хранилище") НастройкиХранилища)

	_БазаПодключеннаяКХранилищу = БазаПодключеннаяКХранилищу;

	ЗаполнитьНастройкиХранилища(НастройкиХранилища);

	ВременныеФайлы = НастройкиПриложения.ВременныеФайлы();

	ПодключенКХранилищу = Ложь;
	ОбъектыЗахвачены = Ложь;
	ВременныйКонтекст = Ложь;

КонецПроцедуры

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьСКонтекстом() Экспорт

	Конфигуратор = Новый УправлениеКонфигуратором();

	СтрокаПодключения = СтрокаПодключенияКРазработческойБазе();

	ВременныйКонтекст = Ложь;

	Если ПустаяСтрока(СтрокаПодключения) Тогда
		ВременныйКонтекст = Истина;
	Иначе
		Лог.Отладка("Строка подключения к БД: %1", СтрокаПодключения);
		Авторизация = _БазаПодключеннаяКХранилищу["Авторизация"];
		Логин = "";
		Пароль = "";
		Если ЗначениеЗаполнено(Авторизация) Тогда
			Логин = Авторизация["Логин"];
			Пароль = Авторизация["Пароль"];
		КонецЕсли;
		Конфигуратор.УстановитьКонтекст(СтрокаПодключения, Логин, Пароль);
	КонецЕсли;

	УстановитьИмяФайлаСообщенийПлатформы();

КонецПроцедуры

Процедура ПодключитьсяКХранилищу(ИмяРасширения = Неопределено) Экспорт

	Лог.Отладка("Подключаюсь к хранилищу...");

	КаталогХранилища = ФС.ПолныйПуть(_НастройкиХранилища["Путь"]);

	ПутьКФайлуХранилища = ОбъединитьПути(КаталогХранилища, "1cv8ddb.1CD");
	ФайлХранилища = Новый Файл(ПутьКФайлуХранилища);
	Ожидаем.Что(ФайлХранилища.Существует(),
		СтрШаблон("Не обнаружено хранилище ""%1""", ФайлХранилища.ПолноеИмя))
		.Равно(Истина);

	ИгнорироватьНаличиеПодключеннойБД = Истина;
	ЗаменитьКонфигурациюБД = Ложь;

	Конфигуратор.ПодключитьсяКХранилищу(
		КаталогХранилища,
		_НастройкиХранилища["Логин"],
		_НастройкиХранилища["Пароль"],
		ИгнорироватьНаличиеПодключеннойБД,
		ЗаменитьКонфигурациюБД,
		ИмяРасширения);

	ПодключенКХранилищу = Истина;

КонецПроцедуры

Процедура ОтключитьсяОтХранилища(ИмяРасширения = Неопределено) Экспорт

	Если ПодключенКХранилищу Тогда
		Лог.Отладка("Отключаюсь от хранилища...");
		Конфигуратор.ОтключитьсяОтХранилища(ИмяРасширения);
		ПодключенКХранилищу = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ЗахватитьОбъектыВХранилище(СписокОбъектов, ИмяРасширения = Неопределено) Экспорт

	Лог.Отладка("Захватываю объекты в хранилище...");

	ФайлСпискаОбъектов = Новый Файл(СписокОбъектов);
	Ожидаем.Что(ФайлСпискаОбъектов.Существует(),
		СтрШаблон("Не обнаружен файл списка объектов ""%1""", СписокОбъектов))
		.Равно(Истина);

	ПолучатьЗахваченныеОбъекты = Ложь;
	ОбъектыЗахвачены = Истина;

	Конфигуратор.ЗахватитьОбъектыВХранилище(
		ФС.ПолныйПуть(_НастройкиХранилища["Путь"]),
		_НастройкиХранилища["Логин"],
		_НастройкиХранилища["Пароль"],
		СписокОбъектов,
		ПолучатьЗахваченныеОбъекты,
		ИмяРасширения);

КонецПроцедуры

Процедура ОтменитьЗахватОбъектовВХранилище(СписокОбъектов, ИмяРасширения = Неопределено) Экспорт

	Лог.Отладка("Отменяю захват объектов в хранилище...");

	ИгнорироватьИзменения = Истина;

	Конфигуратор.ОтменитьЗахватОбъектовВХранилище(
		ФС.ПолныйПуть(_НастройкиХранилища["Путь"]),
		_НастройкиХранилища["Логин"],
		_НастройкиХранилища["Пароль"],
		СписокОбъектов,
		ИгнорироватьИзменения,
		ИмяРасширения);

	ОбъектыЗахвачены = Ложь;

КонецПроцедуры

Процедура ПоместитьИзмененияОбъектовВХранилище(СписокОбъектов, Комментарий, ИмяРасширения = Неопределено) Экспорт

	Лог.Отладка("Помещаю изменения в хранилище...");

	ОставитьОбъектыЗахваченными = Ложь;
	ИгнорироватьУдаленные = Истина;

	Конфигуратор.ПоместитьИзмененияОбъектовВХранилище(
		ФС.ПолныйПуть(_НастройкиХранилища["Путь"]),
		_НастройкиХранилища["Логин"],
		_НастройкиХранилища["Пароль"],
		СписокОбъектов,
		Комментарий,
		ОставитьОбъектыЗахваченными,
		ИгнорироватьУдаленные,
		ИмяРасширения);

	ОбъектыЗахвачены = Ложь;

КонецПроцедуры

Процедура ОбъединитьКонфигурациюСФайлом(
	ПутьКФайлуКонфигурации,
	НастройкиСлияния,
	ПоставитьНаПоддержку,
	ВключитьВОбъединениеОбъектыПоНеразрешеннымСсылкам,
	Принудительно,
	ИмяРасширения = Неопределено) Экспорт

	Лог.Отладка("Объединяю конфигурацию хранилища с файлом...");

	ФайлКонфигурации = Новый Файл(ПутьКФайлуКонфигурации);
	Ожидаем.Что(ФайлКонфигурации.Существует(),
		СтрШаблон("Не обнаружен файл конфигурации ""%1""", ПутьКФайлуКонфигурации))
		.Равно(Истина);

	ПараметрыХранилища = Новый Структура;
	ПараметрыХранилища.Вставить("СтрокаПодключенияХранилище", ФС.ПолныйПуть(_НастройкиХранилища["Путь"]));
	ПараметрыХранилища.Вставить("ПользовательХранилища", _НастройкиХранилища["Логин"]);
	ПараметрыХранилища.Вставить("ПарольХранилища", _НастройкиХранилища["Пароль"]);

	Конфигуратор.ОбъединитьКонфигурациюСФайлом(
		ПутьКФайлуКонфигурации,
		НастройкиСлияния,
		ПоставитьНаПоддержку,
		ВключитьВОбъединениеОбъектыПоНеразрешеннымСсылкам,
		Принудительно,
		ПараметрыХранилища,
		ИмяРасширения);

КонецПроцедуры

Функция Сравнить(КонфигурацияПотомок, КонфигурацияПредок, ИмяРасширения = Неопределено) Экспорт

	Лог.Информация("Запускаю сравнение конфигураций...");
	
	ПутьКОтчету = ВременныеФайлы.НовоеИмяФайла("txt");
	ФорматОтчета = "txt";

	Конфигуратор.ПолучитьОтчетОСравненииКонфигурацииСФайлом(
		КонфигурацияПредок,
		ПутьКОтчету,
		ТипыОтчетовОСравнении.Краткий,
		ФорматОтчета,
		ИмяРасширения,
		КонфигурацияПотомок);

	Лог.Информация("Отчет о сравнении готов - %1", ПутьКОтчету);

	Возврат ПутьКОтчету;

КонецФункции

Функция ЭтоВременныйКонтекст() Экспорт
	
	Возврат ВременныйКонтекст;

КонецФункции

Функция ФайлИнформации() Экспорт
	
	Возврат ФайлИнформации;

КонецФункции

Функция ОбъектыЗахвачены() Экспорт
	
	Возврат ОбъектыЗахвачены;

КонецФункции

Функция ПодключенКХранилищу() Экспорт
	
	Возврат ПодключенКХранилищу;

КонецФункции

Процедура УдалитьВременнуюБазу() Экспорт
	
	Конфигуратор.УдалитьВременнуюБазу();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьИмяФайлаСообщенийПлатформы()
	
	ОчищатьФайл = Истина;

	ФайлИнформации = ВременныеФайлы.НовоеИмяФайла("txt");

	Конфигуратор.УстановитьИмяФайлаСообщенийПлатформы(ФайлИнформации, ОчищатьФайл);

КонецПроцедуры

Функция СтрокаПодключенияКРазработческойБазе()
	
	СтрокаПодключения = "";

	Если _БазаПодключеннаяКХранилищу = Неопределено Тогда
		Возврат СтрокаПодключения;
	КонецЕсли;

	СтрокаПодключения = СтрокаПодключенияКСервернойБД();

	Если ПустаяСтрока(СтрокаПодключения) Тогда
		СтрокаПодключения = СтрокаПодключенияКФайловойБД();
	КонецЕсли;

	Возврат СтрокаПодключения;

КонецФункции

Функция СтрокаПодключенияКСервернойБД()
	
	СтрокаПодключения = "";

	НастройкиПодключения = _БазаПодключеннаяКХранилищу["Серверная"];

	Если НастройкиПодключения = Неопределено
		ИЛИ НастройкиПодключения["Используется"] <> Истина Тогда
		Возврат СтрокаПодключения;
	КонецЕсли;
	
	ИмяСервера = НастройкиПодключения["ИмяСервера"];
	ИмяБазы = НастройкиПодключения["ИмяБазы"];

	Порт = НастройкиПодключения["Порт"];
	Порт = ?(ЗначениеЗаполнено(Порт), ":" + Порт, "");

	СтрокаПодключения = СтрШаблон("/IBConnectionString""Srvr=%1%2; Ref='%3'""",
		ИмяСервера, Порт, ИмяБазы);

	Возврат СтрокаПодключения;

КонецФункции

Функция СтрокаПодключенияКФайловойБД()
	
	СтрокаПодключения = "";

	НастройкиПодключения = _БазаПодключеннаяКХранилищу["Файловая"];

	Если НастройкиПодключения = Неопределено
		ИЛИ НастройкиПодключения["Используется"] <> Истина Тогда
		Возврат СтрокаПодключения;
	КонецЕсли;

	КаталогБазы = НастройкиПодключения["Путь"];

	СтрокаПодключения = СтрШаблон("/F""%1""", КаталогБазы);

	Возврат СтрокаПодключения;

КонецФункции

Процедура ЗаполнитьНастройкиХранилища(НастройкиХранилища)
	
	Если ЗначениеЗаполнено(НастройкиХранилища) Тогда
		_НастройкиХранилища = НастройкиХранилища;
	Иначе
		_НастройкиХранилища = Новый Соответствие;
		_НастройкиХранилища.Вставить("Путь");
		_НастройкиХранилища.Вставить("Логин");
		_НастройкиХранилища.Вставить("Пароль");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти