#Использовать gitrunner
#Использовать xml-parser

&Логгер Перем Лог; // Управление логированием

Перем КаталогПроекта; // Рабочий каталог проекта
Перем ИмяПроекта; // Имя проекта
Перем Гит; // Управление репозиторием Git

&Желудь
Процедура ПриСозданииОбъекта(
	&Пластилин НастройкиПриложения)
	
	КаталогПроекта = НастройкиПриложения.КаталогПроекта();
	ИмяПроекта = НастройкиПриложения.ИмяПроекта();

КонецПроцедуры

#Область ПрограммныйИнтерфейс

Процедура ПереключитьсяНаВетку(ИмяВетки) Экспорт

	Гит().ПерейтиВВетку(ИмяВетки);

КонецПроцедуры

Функция ИдентификаторКоммитаHead(Формат = "") Экспорт // BSLLS:LatinAndCyrillicSymbolInWord-off
	
	ПараметрыКоманды = Новый Массив;
	КомандаСтрокой = СтрШаблон("rev-parse %1", ?(Формат = "Короткий", "--short", ""));
	ПараметрыКоманды.Добавить(КомандаСтрокой);
	ПараметрыКоманды.Добавить("HEAD");

	Гит().ВыполнитьКоманду(ПараметрыКоманды);

	Результат = Гит().ПолучитьВыводКоманды();

	Возврат СокрЛП(Результат);

КонецФункции

Функция НаличиеНезафиксированныхИзменений() Экспорт

	КороткийФормат = Истина;
	СтатусРепозитория = Гит().Статус(КороткийФормат);
	ЕстьИзменения = НЕ ПустаяСтрока(СтатусРепозитория);

	Возврат ЕстьИзменения;

КонецФункции

Функция ТекущаяВерсияХранилища() Экспорт
	
	ПутьКФайлуВерсий = ОбъединитьПути(КаталогПроекта, "VERSION");

	ФайлВерсий = Новый Файл(ПутьКФайлуВерсий);
	Ожидаем.Что(ФайлВерсий.Существует(),
		СтрШаблон("Не обнаружен файл VERSION ""%1""", ПутьКФайлуВерсий))
		.Равно(Истина);

	ПроцессорXML = Новый СериализацияДанныхXML();
	РезультатЧтения = ПроцессорXML.ПрочитатьИзФайла(ПутьКФайлуВерсий);
	Версия = Число(РезультатЧтения["VERSION"]);

	Возврат Версия;

КонецФункции

Функция ТекущаяВетка() Экспорт

	Возврат Гит().ПолучитьТекущуюВетку();

КонецФункции

Функция КаталогИсходников() Экспорт
	
	Возврат "src";

КонецФункции

Функция ИзмененныеФайлыПоСтатусам(Коммит1, Коммит2, Знач КаталогИсходников = Неопределено) Экспорт

	Если КаталогИсходников = Неопределено Тогда
		КаталогИсходников = КаталогИсходников();
	КонецЕсли;

	ПараметрыКоманды = Новый Массив;
	ПараметрыКоманды.Добавить("diff");
	ПараметрыКоманды.Добавить("--no-renames");
	ПараметрыКоманды.Добавить("--name-status");
	ПараметрыКоманды.Добавить(Коммит1);
	ПараметрыКоманды.Добавить(Коммит2);
	ПараметрыКоманды.Добавить("--");
	ПараметрыКоманды.Добавить(КаталогИсходников);

	Гит().ВыполнитьКоманду(ПараметрыКоманды);

	Результат = Гит().ПолучитьВыводКоманды();

	Возврат Результат;

КонецФункции

Функция ИсходноеСодержаниеФайла(ПутьКФайлу, ИдентификаторКоммитаИсходногоСостояния) Экспорт
	
	ПараметрыКоманды = Новый Массив;
	ПараметрыКоманды.Добавить("show");
	ПараметрыКоманды.Добавить(ИдентификаторКоммитаИсходногоСостояния + ":" + ПутьКФайлу);

	Гит().ВыполнитьКоманду(ПараметрыКоманды);

	Результат = Гит().ПолучитьВыводКоманды();

	Возврат Результат;

КонецФункции

Функция КореньРепозитория() Экспорт
	
	ПараметрыКоманды = Новый Массив;
	ПараметрыКоманды.Добавить("rev-parse");
    ПараметрыКоманды.Добавить("--show-toplevel");

	Гит().ВыполнитьКоманду(ПараметрыКоманды);

	Результат = Гит().ПолучитьВыводКоманды();

	Возврат СокрЛП(Результат);

КонецФункции

Процедура ВывестиТекущееРасположение() Экспорт
	
	Лог.Информация("=========================================================");
	Лог.Информация("Текущий проект: %1", ИмяПроекта);
	Лог.Информация("Рабочий каталог: %1", КаталогПроекта);
	Лог.Информация("Текущая ветка: %1", ТекущаяВетка());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Гит()
	
	Если Гит = Неопределено Тогда
		Гит = Новый ГитРепозиторий();
		Гит.УстановитьРабочийКаталог(КаталогПроекта);
	КонецЕсли;

	Возврат Гит;

КонецФункции

#КонецОбласти