#Использовать edtfind
#Использовать asserts
#Использовать fs

&Логгер Перем Лог; // Управление логированием
&ЛоггерВнешний Перем ЛогВнешний; // Управление внешним логированием

Перем ИмяПроекта; // Текущее имя проекта (конфигурации/расширения)
Перем ИмяБазовогоПроекта; // Имя базового проекта
Перем РабочийКаталог; // Текущий рабочий каталог
Перем ВременныеФайлы; // Управление временными файлами
Перем ИсполняемыйФайл; // Путь к утилите 1cedtcli
Перем ВерсияEDT; // Версия EDT

&Желудь
Процедура ПриСозданииОбъекта(
	&Пластилин НастройкиПриложения)

	ИмяПроекта = НастройкиПриложения.ИмяПроекта();
	ИмяБазовогоПроекта = НастройкиПриложения.ИмяБазовогоПроекта();
	РабочийКаталог = НастройкиПриложения.РабочийКаталог();
	ВременныеФайлы = НастройкиПриложения.ВременныеФайлы();

КонецПроцедуры

#Область Программный_интерфейс

// Возвращает путь к утилите 1cedtcli
//
// Возвращаемое значение:
//  Строка
Функция ИсполняемыйФайл() Экспорт

	Если ИсполняемыйФайл = Неопределено Тогда
		ОпределитьИсполняемыйФайл();
	КонецЕсли;

	Возврат ИсполняемыйФайл;
	
КонецФункции

// Выгружает проект в файлы xml
// 
// Параметры:
//  КаталогРабочейОбласти - Строка - Путь к каталогу workspace
//  КаталогПроекта - Строка - Путь к каталогу проекта, в котором располагается файл .project
//  КаталогВыгрузки - Строка - Путь к каталогу, в который нужно выгрузить файлы. Абсолютный или относительный.
//
// Возвращаемое значение:
//	Строка - Путь к каталогу файлов выгруженного проекта
//
Функция ВыгрузитьПроектВФайлы(КаталогРабочейОбласти = Неопределено,
	КаталогПроекта = Неопределено, КаталогВыгрузки = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(КаталогПроекта) Тогда
		КаталогПроекта = РабочийКаталог;
	КонецЕсли;

	КаталогРабочейОбласти = ОбеспечитьКаталогРабочейОбласти(КаталогРабочейОбласти);
	КаталогВыгрузки = ОбеспечитьПустойКаталогВыгрузки(КаталогВыгрузки);

	Лог.Информация("Начинаю выгрузку проекта %1 в каталог %2", ИмяПроекта, КаталогВыгрузки);

	Команда = Новый Команда;
	Команда.УстановитьКоманду(ИсполняемыйФайл());
	Команда.ДобавитьПараметр("-data");
	Команда.ДобавитьПараметр(Команда.ОбернутьВКавычки(КаталогРабочейОбласти));
	Команда.ДобавитьПараметр("-command export");
	Команда.ДобавитьПараметр(СтрШаблон("--project %1", Команда.ОбернутьВКавычки(КаталогПроекта)));
	Команда.ДобавитьПараметр(СтрШаблон("--configuration-files %1", Команда.ОбернутьВКавычки(КаталогВыгрузки)));
	Команда.ДобавитьЛогВыводаКоманды(ЛогВнешний);

	КодВозврата = Команда.Исполнить();

	СообщениеОшибки = СтрШаблон("Возникли ошибки при выгрузке конфигурации проекта в файлы:%1",
		Символы.ПС + Команда.ПолучитьВывод());
	Ожидаем.Что(КодВозврата, СообщениеОшибки).Равно(0);
	
	ВременныеФайлы.Удалить();

	Лог.Информация("Конфигурация проекта выгружена в каталог %1", КаталогВыгрузки);

	Возврат КаталогВыгрузки;

КонецФункции

#КонецОбласти

#Область Служебные_процедуры_и_функции

Функция ОбеспечитьКаталогРабочейОбласти(Знач Каталог)
	
	Если НЕ ЗначениеЗаполнено(Каталог) Тогда

		ИспользуемоеИмяПроекта = ИмяПроекта;
		Если ЗначениеЗаполнено(ИмяБазовогоПроекта) Тогда
			ИспользуемоеИмяПроекта = ИмяБазовогоПроекта;
		КонецЕсли;

		ВременныйКаталог = ВременныеФайлы.СоздатьКаталог();
		Каталог = ОбъединитьПути(ВременныйКаталог, "workspace", ИспользуемоеИмяПроекта);
		
	КонецЕсли;

	ФС.ОбеспечитьКаталог(Каталог);

	Возврат Каталог;

КонецФункции

Функция ОбеспечитьПустойКаталогВыгрузки(Знач Каталог)

	Если НЕ ЗначениеЗаполнено(Каталог) Тогда
		Каталог = ОбъединитьПути(РабочийКаталог, "export_" + ИмяПроекта);
	КонецЕсли;

	ФС.ОбеспечитьПустойКаталог(Каталог);

	Возврат Каталог;

КонецФункции

// область кода взята из плагина edtExport для gitsync
// https://github.com/oscript-library/gitsync-plugins/blob/master/src/Классы/edtExport.os
#Область GitSyncEdtExport

Функция ОпределитьИсполняемыйФайл()
	
	ИсполняемыйФайл = "";

	ОбъектПоиска = Новый ПоискEDT();
	РезультатПоиска = ОбъектПоиска.НайтиИнформациюОEDT(ВерсияEDT);

	Если Не ЗначениеЗаполнено(ВерсияEDT) Тогда
		Лог.Информация("Версия EDT не передана через параметры, определена автоматически: %1", РезультатПоиска.ВерсияEDT);
		ВерсияEDT = РезультатПоиска.ВерсияEDT;
	КонецЕсли;

	Лог.Информация("Версия EDT: %1, каталог %2", РезультатПоиска.ВерсияEDT, РезультатПоиска.КаталогEDT);

	Использовать1cedtcli = ЗначениеЗаполнено(РезультатПоиска.ПутьКcli); // BSLLS:LatinAndCyrillicSymbolInWord-off
	Если Использовать1cedtcli Тогда
		ИсполняемыйФайл = РезультатПоиска.ПутьКcli;
	Иначе
		ИсполняемыйФайл = НайтиRing();
	КонецЕсли;

	Возврат ИсполняемыйФайл;
	
КонецФункции

// Функция - выполняет поиск утилиты ring и возвращает полный путь к утилите
//
// Возвращаемое значение:
//  Строка      - полный путь к утилите ring
//
Функция НайтиRing() Экспорт

	Если ЭтоWindows() Тогда
		КаталогПрограмм = ПолучитьПеременнуюСреды("ProgramW6432");
		Расширение = ".cmd";
	Иначе
		КаталогПрограмм = "/opt";
		Расширение = "";
	КонецЕсли;
	ПутьУстановки_1CE = ОбъединитьПути(КаталогПрограмм, "1C", "1CE", "components");
	Файлы = НайтиФайлы(ПутьУстановки_1CE, СтрШаблон("ring%1", Расширение), Истина);

	Если Файлы.Количество() > 0 Тогда
		Возврат Файлы[0].ПолноеИмя;
	КонецЕсли;

	Возврат "";

КонецФункции

// Функция - проверяет, что скрипт выполняется в среде Windows
//
// Возвращаемое значение:
//	Булево     - Истина - скрипт выполняется в среде Windows
//
Функция ЭтоWindows() Экспорт

	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат Найти(НРег(СистемнаяИнформация.ВерсияОС), "windows") > 0;

КонецФункции // ЭтоWindows()

#КонецОбласти

#КонецОбласти