#Использовать asserts
#Использовать xml-parser
#Использовать tempfiles

Перем РабочийКаталог; // Текущий рабочий каталог (cwd), в котором вызвано консольное приложение
Перем ИмяПроекта; // Имя проекта EDT
Перем ИмяБазовогоПроекта; // Имя базового проекта EDT
Перем ИмяРасширения; // Имя расширения

&Желудь
Процедура ПриСозданииОбъекта(
	&Деталька("ВременныйКаталог") ВременныйКаталог)

	РабочийКаталог = ТекущийКаталог();

	ПрочитатьФайлыProject();

	УстановитьБазовыйКаталогВременныхФайлов(ВременныйКаталог);

КонецПроцедуры

#Область ПрограммныйИнтерфейс

Функция РабочийКаталог() Экспорт

	Возврат РабочийКаталог;

КонецФункции

Функция КаталогПроекта() Экспорт

	Возврат РабочийКаталог;

КонецФункции

Функция ИмяПроекта() Экспорт
	
	Возврат ИмяПроекта;

КонецФункции

Функция ИмяБазовогоПроекта() Экспорт
	
	Возврат ИмяБазовогоПроекта;

КонецФункции

Функция ИмяРасширения() Экспорт
	
	Возврат ИмяРасширения;

КонецФункции

Функция ВременныеФайлы() Экспорт

	Возврат ВременныеФайлы;

КонецФункции

Функция ВременныйКаталогВПроекте() Экспорт
	
	Возврат ".v8storagesync";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПрочитатьФайлыProject()

	ПрочитатьDotProject();
	ПрочитатьProjectPMF();

КонецПроцедуры

Процедура ПрочитатьDotProject()

	ПутьКФайлу = ОбъединитьПути(РабочийКаталог, ".project");

	ФайлПроекта = Новый Файл(ПутьКФайлу);
	Ожидаем.Что(ФайлПроекта.Существует(),
		СтрШаблон("Не обнаружен файл описания проекта %1", ПутьКФайлу))
		.Равно(Истина);

	ПроцессорXML = Новый СериализацияДанныхXML();

	РезультатЧтения = ПроцессорXML.ПрочитатьИзФайла(ПутьКФайлу);

	ИмяПроекта = РезультатЧтения["projectDescription"]["name"];

	ЭлементыNatures = РезультатЧтения["projectDescription"]["natures"];
	Для каждого Элемент Из ЭлементыNatures Цикл
		Если СтрЗаканчиваетсяНа(Элемент["nature"], "V8ExtensionNature") Тогда
			ЧастиИмени = СтрРазделить(ИмяПроекта, ".", Ложь);
			ИмяРасширения = ЧастиИмени[ЧастиИмени.ВГраница()];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПрочитатьProjectPMF()

	ПутьКФайлу = ОбъединитьПути(РабочийКаталог, "DT-INF", "PROJECT.PMF");
	
	ФайлПроекта = Новый Файл(ПутьКФайлу);
	Ожидаем.Что(ФайлПроекта.Существует(),
		СтрШаблон("Не обнаружен файл описания проекта %1", ПутьКФайлу))
		.Равно(Истина);

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу);
	Строка = ЧтениеТекста.ПрочитатьСтроку();
	Пока Строка <> Неопределено Цикл
		Подстроки = СтрРазделить(Строка, ": ", Ложь);
		Если Подстроки.Количество() И Подстроки[0] = "Base-Project" Тогда
			ИмяБазовогоПроекта = Подстроки[1];
			Прервать;
		КонецЕсли;
		Строка = ЧтениеТекста.ПрочитатьСтроку();
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьБазовыйКаталогВременныхФайлов(ВременныйКаталог)

	Если ЗначениеЗаполнено(ВременныйКаталог) Тогда

		ФайлВременныйКаталог = Новый Файл(ВременныйКаталог);
		
		Если Не ФайлВременныйКаталог.Существует() Тогда
			СоздатьКаталог(ФайлВременныйКаталог.ПолноеИмя);
		КонецЕсли;

		// Явно зададим базовый каталог
		ВременныеФайлы.БазовыйКаталог = ФайлВременныйКаталог.ПолноеИмя;

	КонецЕсли;

	// Базовый каталог установим временным каталогом, который после работы удалим
	ВременныеФайлы.БазовыйКаталог = ВременныеФайлы.СоздатьКаталог();

	// Это специально для 1С
	УстановитьПеременнуюСреды("TEMP", ВременныеФайлы.БазовыйКаталог);
	УстановитьПеременнуюСреды("Temp", ВременныеФайлы.БазовыйКаталог);
	УстановитьПеременнуюСреды("Tmp", ВременныеФайлы.БазовыйКаталог);

КонецПроцедуры

#КонецОбласти