#Использовать fs
#Использовать xml-parser
#Использовать v8storage

// BSLLS:LatinAndCyrillicSymbolInWord-off

&Логгер Перем Лог; // Управление логированием
&Пластилин Перем МенеджерРепозиторияПроекта; // Управление репозиторием Git

Перем ВременныеФайлы; // Управление временными файлами
Перем ПроцессорXML; // Управление сериализацией XML
Перем ИмяПроекта; // Имя проекта
Перем КаталогПроекта; // Каталог проекта
Перем КореньКонфигурации; // Структура: * ИмяКонфигурации, * Изменен

&Желудь
Процедура ПриСозданииОбъекта(
	&Пластилин НастройкиПриложения)

	ВременныеФайлы = НастройкиПриложения.ВременныеФайлы();
	КаталогПроекта = НастройкиПриложения.КаталогПроекта();
	ИмяПроекта = НастройкиПриложения.ИмяПроекта();

	КореньКонфигурации = Новый Структура("ИмяКонфигурации, Изменен", "", Ложь);

КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Возвращает таблицу измененных объектов V8.
//
// Параметры:
// 	ИзмененныеИсходники - Строка - См. МенеджерРепозиторияПроекта.ИзмененныеФайлыПоСтатусам.
// 	КоммитПредка - Строка - Идентификатор исходного родительского git-коммита.
//		Используется для определения исходного имени объекта до его переименования/удаления.
//
// Возвращаемое значение:
// 	ТаблицаЗначений - См. НоваяТаблицаИзмененныхОбъектовV8
//
Функция ИзмененныеОбъектыV8(ИзмененныеИсходники, КоммитПредка) Экспорт

	ТаблицаМетаданных = ТаблицаМетаданныхEDTИзмененныхОбъектов(ИзмененныеИсходники, КоммитПредка);

	ПутьКФайлу = НайтиФайлConfigDumpInfo();
	ТаблицаМетаданныхV8 = ПрочитатьConfigDumpInfo(ПутьКФайлу);

	ТаблицаИзмененныхОбъектовV8 = СоздатьТаблицуИзмененныхОбъектовV8(ТаблицаМетаданных, ТаблицаМетаданныхV8);

	Возврат ТаблицаИзмененныхОбъектовV8;

КонецФункции

// Возвращает путь к созданному файлу настроек слияния.
// Формируется файл настроек по умолчанию со свойствами:
// 		ConfigurationsRelation = SecondConfigurationIsDescendantOfMainConfiguration
//	    AllowMainConfigurationObjectDeletion = true
// 		CopyObjectsMode = false
// При обнаружении файла AutoMergeSettings.xml в корне проекта, его настройки
// переносятся в создаваемый файл настроек, предзаполненный по умолчанию.
// В создаваемом файле настроек принудительно заполняются разделы Conformities и Objects,
// эти разделы не переопределяются во внешнем файле AutoMergeSettings.xml.
//
// Параметры:
// 	ТаблицаИзмененныхОбъектовV8 - ТаблицаЗначений - См. НоваяТаблицаИзмененныхОбъектовV8
//
// Возвращаемое значение:
// 	Строка - Путь к созданному файлу настроек слияния
//
Функция СоздатьФайлНастроекСлияния(ТаблицаИзмененныхОбъектовV8) Экспорт
	
	НастройкиСлияния = НастройкиСлиянияПоУмолчанию();

	КореньРепозитория = МенеджерРепозиторияПроекта.КореньРепозитория();
	ФайлНастроек = ОбъединитьПути(КореньРепозитория, "AutoMergeSettings.xml");
	ЗаполнитьНастройкиСлиянияИзФайла(НастройкиСлияния, ФайлНастроек);

	ЗаполнитьПравилаСлиянияИОбъединенияОбъектов(НастройкиСлияния, ТаблицаИзмененныхОбъектовV8);

	ПутьКФайлу = ВременныеФайлы.НовоеИмяФайла("xml");
	ЗаписатьФайлНастроекСлияния(НастройкиСлияния, ПутьКФайлу);

	Лог.Информация("Создан файл настроек %1", ПутьКФайлу);

	Возврат ПутьКФайлу;

КонецФункции

// Возвращает путь к созданному файлу списка объектов для их захвата в хранилище.
//
// Параметры:
// 	ТаблицаИзмененныхОбъектовV8 - ТаблицаЗначений - См. НоваяТаблицаИзмененныхОбъектовV8
//
// Возвращаемое значение:
// 	Строка - путь к созданному файлу списка объектов
//
Функция СоздатьСписокОбъектовДляЗахвата(ТаблицаИзмененныхОбъектовV8) Экспорт

	СписокОбъектов = Новый СписокОбъектовКонфигурации();

	ВСписокОбъектовДобавитьОписаниеКонфигурации(СписокОбъектов);

	Для каждого СоответствиеОбъекта Из ТаблицаИзмененныхОбъектовV8 Цикл

		ПолноеИмяОбъекта = СоответствиеОбъекта.ПолноеИмяОбъекта;
		Если ЗначениеЗаполнено(СоответствиеОбъекта.ВладелецОбъекта) Тогда
			// это подчиненный объект, для захвата которого необходим захват владельца
			ПолноеИмяОбъекта = СоответствиеОбъекта.ВладелецОбъекта;
		КонецЕсли;

		ВСписокОбъектовДобавитьОбъектКонфигурации(СписокОбъектов, ПолноеИмяОбъекта);

	КонецЦикла;

	ПутьКФайлу = Неопределено;

	ЕстьИзменения = СписокОбъектов.ПолучитьТаблицуОбъектов().Количество() ИЛИ КореньКонфигурации.Изменен;

	Если ЕстьИзменения Тогда

		ПутьКФайлу = ВременныеФайлы.НовоеИмяФайла("xml");
		СписокОбъектов.ЗаписатьФайлОбъектов(ПутьКФайлу);

		Лог.Отладка("Создан список объектов: ""%1""", ПутьКФайлу);

	Иначе

		Лог.Отладка("Список объектов пустой");

	КонецЕсли;

	Возврат ПутьКФайлу;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВСписокОбъектовДобавитьОписаниеКонфигурации(СписокОбъектов)
	
	Если КореньКонфигурации.Изменен Тогда

		СписокОбъектов.ДобавитьОписаниеКонфигурации(КореньКонфигурации.ИмяКонфигурации);

		Лог.Отладка("В список объектов добавлен: Корень конфигурации");

	КонецЕсли;

КонецПроцедуры

Процедура ВСписокОбъектовДобавитьОбъектКонфигурации(СписокОбъектов, ПолноеИмяОбъекта)
	
	ТаблицаОбъектов = СписокОбъектов.ПолучитьТаблицуОбъектов();

	Если ТаблицаОбъектов.Найти(ПолноеИмяОбъекта, "ПолноеИмя") = Неопределено Тогда

		ВключатьПодчиненные = Ложь;
		ПутьКФайлуИсходника = "";
		СписокОбъектов.ДобавитьОбъектКонфигурации(ПолноеИмяОбъекта, ВключатьПодчиненные, ПутьКФайлуИсходника);

		Лог.Отладка("В список объектов добавлен: %1", ПолноеИмяОбъекта);

	КонецЕсли;

КонецПроцедуры

// Заполняет правила настроек слияния и объединения объектов.
// Заполняет разделы Conformities (настройки сопоставления) и
// Objects (настройки объединения) файла AutoMergeSettings.xml.
//
// Параметры:
// 	НастройкиСлияния - Соответствие - См. НастройкиСлиянияПоУмолчанию
// 	ТаблицаИзмененныхОбъектовV8 - ТаблицаЗначений - См. НоваяТаблицаИзмененныхОбъектовV8
//
Процедура ЗаполнитьПравилаСлиянияИОбъединенияОбъектов(НастройкиСлияния, ТаблицаИзмененныхОбъектовV8)

	Conformities = Новый Массив;
	Objects = Новый Массив;

	ДобавитьПравилоОбъединенияКорня(Objects);

	Для каждого СтрокаСопоставления Из ТаблицаИзмененныхОбъектовV8 Цикл
		ДобавитьПравилоСопоставления(Conformities, СтрокаСопоставления);
		ДобавитьПравилоОбъединения(Objects, СтрокаСопоставления);
	КонецЦикла;

	НастройкиСлияния["Settings"]._Элементы["Conformities"] = Conformities;
	НастройкиСлияния["Settings"]._Элементы["Objects"] = Objects;

КонецПроцедуры

Процедура ДобавитьПравилоСопоставления(Conformities, СтрокаСопоставления)
	
	Conformity = Новый Структура("_Атрибуты", Новый Соответствие);
	Conformity._Атрибуты.Вставить("fullName", СтрокаСопоставления.ПолноеИмяОбъекта);
	Conformity._Атрибуты.Вставить("fullNameInSecondConfiguration", СтрокаСопоставления.ПолноеИмяОбъектаНовое);

	НовоеСоответствие = Новый Соответствие;
	НовоеСоответствие.Вставить("Conformity", Conformity);

	Conformities.Добавить(НовоеСоответствие);

КонецПроцедуры

Процедура ДобавитьПравилоОбъединения(Objects, СтрокаСопоставления)

	Object = Новый Структура("_Атрибуты, _Элементы", Новый Соответствие, Новый Соответствие);
	Object._Атрибуты.Вставить("fullName", СтрокаСопоставления.ПолноеИмяОбъекта);
	Object._Элементы.Вставить("MergeRule", "GetFromSecondConfiguration");
	Object._Элементы.Вставить("ObjectOrder", "GetFromMainConfiguration");

	НовоеСоответствие = Новый Соответствие;
	НовоеСоответствие.Вставить("Object", Object);

	Objects.Добавить(НовоеСоответствие);
	
КонецПроцедуры

Процедура ДобавитьПравилоОбъединенияКорня(Objects)
	
	Если КореньКонфигурации.Изменен Тогда
		
		Configuration = Новый Соответствие;
		Configuration.Вставить("MergeRule", "GetFromSecondConfiguration");
		Configuration.Вставить("ObjectOrder", "GetFromMainConfiguration");

		НовоеСоответствие = Новый Соответствие;
		НовоеСоответствие.Вставить("Configuration", Configuration);

		Objects.Добавить(НовоеСоответствие);

	КонецЕсли;

КонецПроцедуры

// Возвращает настройки слияния по умолчанию.
// Метод заполняет только раздел Parameters, остальные разделы остаются пустыми.
// 
// Возвращаемое значение:
//  Соответствие - описание файла XML по правилам библиотеки xml-parser.
//
Функция НастройкиСлиянияПоУмолчанию()

	Атрибуты = Новый Соответствие;
	Атрибуты.Вставить("xmlns", "http://v8.1c.ru/8.3/config/merge/settings");
	Атрибуты.Вставить("xmlns:xs", "http://www.w3.org/2001/XMLSchema");
	Атрибуты.Вставить("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	Атрибуты.Вставить("version", "1.2");
	Атрибуты.Вставить("platformVersion", "8.3.11");

	Элементы = Новый Соответствие;
	Элементы.Вставить("MainConfiguration");
	Элементы.Вставить("SecondConfiguration");
	Элементы.Вставить("OldVendorConfiguration");
	Элементы.Вставить("SupportRules");

	НастройкиПараметров = Новый Соответствие;
	НастройкиПараметров.Вставить("ConfigurationsRelation", "SecondConfigurationIsDescendantOfMainConfiguration");
	НастройкиПараметров.Вставить("AllowMainConfigurationObjectDeletion", "true");
	НастройкиПараметров.Вставить("CopyObjectsMode", "false");
	Элементы.Вставить("Parameters", НастройкиПараметров);

	Элементы.Вставить("Conformities");
	Элементы.Вставить("Objects");

	СтруктураНастроек = Новый Структура("_Атрибуты, _Элементы", Атрибуты, Элементы);

	НастройкиСлияния = Новый Соответствие;
	НастройкиСлияния.Вставить("Settings", СтруктураНастроек);

	Возврат НастройкиСлияния;

КонецФункции

Процедура ЗаполнитьНастройкиСлиянияИзФайла(НастройкиСлияния, ФайлНастроек)

	Если ФайлНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Файл = Новый Файл(ФайлНастроек);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;

	РезультатЧтения = ПроцессорXML().ПрочитатьИзФайла(ФайлНастроек);

	АтрибутыНастроекЧтение = РезультатЧтения["Settings"]["_Атрибуты"]; // BSLLS:DuplicateStringLiteral-off
	НастройкиСлияния["Settings"]["_Атрибуты"] = АтрибутыНастроекЧтение;

	ЭлементыНастроекЧтение = РезультатЧтения["Settings"]["_Элементы"]; // BSLLS:DuplicateStringLiteral-off
	Для каждого КЗ Из НастройкиСлияния["Settings"]["_Элементы"] Цикл
		Раздел = КЗ.Ключ;
		РазделЧтение = ЭлементыНастроекЧтение[Раздел];
		Если РазделЧтение <> Неопределено Тогда
			НастройкиСлияния["Settings"]["_Элементы"][Раздел] = РазделЧтение;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьФайлНастроекСлияния(НастройкиСлияния, ПутьКФайлу)

	// удаление пустых разделов настроек
	РазделыКУдалению = Новый Массив;
	ЭлементыНастроек = НастройкиСлияния["Settings"]["_Элементы"];
	Для каждого Раздел Из ЭлементыНастроек Цикл
		Если Раздел.Значение = Неопределено Тогда
			РазделыКУдалению.Добавить(Раздел.Ключ);
		КонецЕсли;
	КонецЦикла;
	Для каждого Раздел Из РазделыКУдалению Цикл
		ЭлементыНастроек.Удалить(Раздел);
	КонецЦикла;

	ЗаписатьОбъявлениеXML = Истина;
	ПроцессорXML().ЗаписатьВФайл(НастройкиСлияния, ПутьКФайлу, ЗаписатьОбъявлениеXML);

КонецПроцедуры

Функция ПроцессорXML()
	
	Если ПроцессорXML = Неопределено Тогда
		ПроцессорXML = Новый СериализацияДанныхXML();
	КонецЕсли;

	Возврат ПроцессорXML;

КонецФункции

#Область ТаблицаИзмененныхОбъектовV8

Функция ТаблицаМетаданныхEDTИзмененныхОбъектов(ИзмененныеИсходники, КоммитПредка)
	
	ТаблицаМетаданных = НоваяТаблицаМетаданныхEDT();

	ИзмененныеОбъекты = ИзмененныеОбъекты(ИзмененныеИсходники);

	ПутьКФайлу = ПутьКФайлуМетаданныхОбъектаКонфигурация(ИзмененныеОбъекты["Configuration"]);
	Если ПутьКФайлу <> Неопределено Тогда

		ДобавитьОписаниеОбъектаКонфигурацияВТаблицуМетаданных(ПутьКФайлу, ТаблицаМетаданных, КоммитПредка);
		ЗаполнитьСостояниеКорняКонфигурации(ПутьКФайлу);
		ИзмененныеОбъекты.Удалить("Configuration");

	КонецЕсли;

	ДобавитьВТаблицуМетаданныхИзмененныеОбъекты(ТаблицаМетаданных, ИзмененныеОбъекты, КоммитПредка);

	Возврат ТаблицаМетаданных;
	
КонецФункции

Процедура ДобавитьВТаблицуМетаданныхИзмененныеОбъекты(ТаблицаМетаданных, ИзмененныеОбъекты, КоммитПредка)
	
	Для каждого КлючИЗначение Из ИзмененныеОбъекты Цикл

		СведенияОбИсходниках = КлючИЗначение.Значение;

		ФайлыМетаданных = ФайлыМетаданныхПоИсходникам(СведенияОбИсходниках, КоммитПредка);

		Для каждого СведенияОФайле Из ФайлыМетаданных Цикл

			ОписаниеОбъекта = ПрочитатьМетаданныеОбъекта(СведенияОФайле.Путь);

			Если ИдентификаторДобавленВТаблицу(ОписаниеОбъекта.Идентификатор, ТаблицаМетаданных) Тогда
				Продолжить;
			КонецЕсли;
			
			ПолноеИмяОбъекта = ПутьКФайлуВИмяОбъекта(СведенияОФайле.СтарыйПуть);
			ДобавитьВТаблицуМетаданныхEDT(ОписаниеОбъекта, ТаблицаМетаданных, ПолноеИмяОбъекта);
		
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

Функция ИдентификаторДобавленВТаблицу(Идентификатор, Таблица)
	
	СтрокаПоИдентификатору = Таблица.Найти(Идентификатор, "ИдентификаторОбъекта");

	Возврат СтрокаПоИдентификатору <> Неопределено;

КонецФункции

Функция ПутьКФайлуМетаданныхОбъектаКонфигурация(СведенияОФайлахКонфигурации)

	ПутьКМетаданным = Неопределено;

	Если СведенияОФайлахКонфигурации = Неопределено Тогда
		Возврат ПутьКМетаданным;
	КонецЕсли;

	Для каждого СведенияОФайле Из СведенияОФайлахКонфигурации Цикл
		
		Если СтрЗаканчиваетсяНа(СведенияОФайле.Путь, "Configuration.mdo") Тогда
			ПутьКМетаданным = СведенияОФайле.Путь;
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат ПутьКМетаданным;

КонецФункции

Процедура ДобавитьОписаниеОбъектаКонфигурацияВТаблицуМетаданных(
		ПутьКФайлуМетаданныхКонфигурации, ТаблицаМетаданных, КоммитПредка)

	СведенияОбИсходномФайле = СведенияОбИсходномФайлеМетаданных(ПутьКФайлуМетаданныхКонфигурации, КоммитПредка);

	ФайлыМетаданных = Новый Массив;
	ФайлыМетаданных.Добавить(ПутьКФайлуМетаданныхКонфигурации);
	ФайлыМетаданных.Добавить(СведенияОбИсходномФайле.Путь);

	Для каждого ПутьКФайлу Из ФайлыМетаданных Цикл

		ОписаниеОбъекта = ПрочитатьМетаданныеОбъекта(ПутьКФайлу);
		ПолноеИмяОбъекта = "Configuration";
		ДобавитьВТаблицуМетаданныхEDT(ОписаниеОбъекта, ТаблицаМетаданных, ПолноеИмяОбъекта);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьСостояниеКорняКонфигурации(ПутьКФайлу)
	
	ОписаниеОбъекта = ПрочитатьМетаданныеОбъекта(ПутьКФайлу);
	КореньКонфигурации.ИмяКонфигурации = ОписаниеОбъекта.Имя;
	КореньКонфигурации.Изменен = Истина;

КонецПроцедуры

Функция НайтиФайлConfigDumpInfo()
	
	ПутьКФайлу = ОбъединитьПути(КаталогПроекта, "ConfigDumpInfo.xml");

	ФайлConfigDumpInfo = Новый Файл(ПутьКФайлу);

	Ожидаем.Что(ФайлConfigDumpInfo.Существует(),
		СтрШаблон("Не найден файл ""%1""", ПутьКФайлу))
		.Равно(Истина);

	Возврат ФайлConfigDumpInfo.ПолноеИмя;

КонецФункции

Функция ПрочитатьConfigDumpInfo(ПутьКФайлу)
	
	ТаблицаМетаданных = НоваяТаблицаМетаданныхV8();

	РезультатЧтения = ПроцессорXML().ПрочитатьИзФайла(ПутьКФайлу);

	Корень = РезультатЧтения["ConfigDumpInfo"];

	МетаданныеОбъектов = Корень._Элементы["ConfigVersions"];

	Для каждого МетаданныеОбъекта Из МетаданныеОбъектов Цикл

		СтрокаТаблицы = ДобавитьВТаблицуМетаданныхV8(ТаблицаМетаданных, МетаданныеОбъекта);
		ПолноеИмяОбъекта = СтрокаТаблицы.ПолноеИмяОбъекта;

		ОписаниеМетаданных = МетаданныеОбъекта["Metadata"];
		ЕстьПодчиненныеМетаданные = ОписаниеМетаданных.Свойство("_Элементы");
		Если НЕ ЕстьПодчиненныеМетаданные Тогда
			Продолжить;
		КонецЕсли;

		ПодчиненныеМетаданные = ЗначениеВМассив(ОписаниеМетаданных._Элементы);
		Для каждого МетаданныеПодчиненного Из ПодчиненныеМетаданные Цикл

			ДобавитьВТаблицуМетаданныхV8(ТаблицаМетаданных, МетаданныеПодчиненного, ПолноеИмяОбъекта);

		КонецЦикла;
		
	КонецЦикла;

	Возврат ТаблицаМетаданных;

КонецФункции

// Возвращает новую таблицу метаданных для заполнения данными из файла ConfigDumpInfo.
//
// Возвращаемое значение:
// 	ТаблицаЗначений:
// 		* ПолноеИмяОбъекта - Строка - Полное имя объекта в наименовании V8
// 		* ИдентификаторОбъекта - Строка - Идентификатор объекта метаданных
// 		* ВладелецОбъекта - Строка - Полное имя владельца объекта
//
Функция НоваяТаблицаМетаданныхV8()
	
	ТипСтрока = Новый ОписаниеТипов("Строка");

	ТаблицаМетаданных = Новый ТаблицаЗначений;
	ТаблицаМетаданных.Колонки.Добавить("ПолноеИмяОбъекта", ТипСтрока);
	ТаблицаМетаданных.Колонки.Добавить("ИдентификаторОбъекта", ТипСтрока);
	ТаблицаМетаданных.Колонки.Добавить("ВладелецОбъекта", ТипСтрока);

	Возврат ТаблицаМетаданных;

КонецФункции

Функция ДобавитьВТаблицуМетаданныхV8(ТаблицаМетаданных, МетаданныеОбъекта, ВладелецОбъекта = Неопределено)

	ОписаниеМетаданных = МетаданныеОбъекта["Metadata"];
	АтрибутыМетаданных = ОписаниеМетаданных._Атрибуты;

	НоваяСтрока = ТаблицаМетаданных.Добавить();
	НоваяСтрока.ПолноеИмяОбъекта = АтрибутыМетаданных["name"];
	НоваяСтрока.ИдентификаторОбъекта = АтрибутыМетаданных["id"];

	Если ВладелецОбъекта <> Неопределено Тогда
		НоваяСтрока.ВладелецОбъекта = ВладелецОбъекта;
	КонецЕсли;

	Возврат НоваяСтрока;

КонецФункции

// Возвращает новую таблицу метаданных проекта EDT. Таблица заполняется по файлам mdo.
//
// Возвращаемое значение:
// 	ТаблицаЗначений:
// 		* ПолноеИмяОбъекта - Строка - Полное имя объекта, например ExchangePlans.NewПланОбмена1
// 		* ИдентификаторОбъекта - Строка - Идентификатор объекта метаданных
//
Функция НоваяТаблицаМетаданныхEDT()
	
	ТаблицаМетаданных = Новый ТаблицаЗначений;
	ТаблицаМетаданных.Колонки.Добавить("ПолноеИмяОбъекта");
	ТаблицаМетаданных.Колонки.Добавить("ИдентификаторОбъекта");

	Возврат ТаблицаМетаданных;

КонецФункции

// Возвращает путь к измененным файлам и признак удаления файла.
//
// Параметры:
// 	ИзмененныеИсходники - Массив Из Строка - См. МенеджерРепозиторияПроекта.ИзмененныеФайлыПоСтатусам
//
// Возвращаемое значение:
// 	Соответствие Из КлючИЗначение:
// 		* Ключ - Строка - Имя объекта владельца файла, например ExchangePlans.NewПланОбмена1
// 		* Значение - Массив Из Структура - См. НовыеСведенияОбИсходнике
//
Функция ИзмененныеОбъекты(ИзмененныеИсходники)
	
	ИзмененныеОбъекты = Новый Соответствие;

	Для каждого ПутьСоСтатусом Из ИзмененныеИсходники Цикл

		ПутьКФайлу = ВыделитьПутьКФайлуИзСтроки(ПутьСоСтатусом);

		ПолноеИмяОбъекта = ПутьКФайлуВИмяОбъекта(ПутьКФайлу);

		Если ИзмененныеОбъекты[ПолноеИмяОбъекта] = Неопределено Тогда
			ИзмененныеОбъекты.Вставить(ПолноеИмяОбъекта, Новый Массив);
		КонецЕсли;

		СведенияОФайле = НовыеСведенияОбИсходнике();
		СведенияОФайле.Путь = ПутьКФайлу;
		СведенияОФайле.Удален = СтрНачинаетсяС(ПутьСоСтатусом, "D");

		ИзмененныеОбъекты[ПолноеИмяОбъекта].Добавить(СведенияОФайле);

	КонецЦикла;

	Возврат ИзмененныеОбъекты;

КонецФункции

Функция ВыделитьПутьКФайлуИзСтроки(ИзмененныйФайл)
	
	НачалоПути = СтрНайти(ИзмененныйФайл, ИмяПроекта) - 1;
	
	ПутьКФайлу = Прав(ИзмененныйФайл, СтрДлина(ИзмененныйФайл) - НачалоПути);

	Возврат СокрЛП(ПутьКФайлу);

КонецФункции

Функция УдалитьПроектИзПути(Знач ПутьКФайлу)
	
	ПутьКФайлу = СтрЗаменить(
		ПутьКФайлу,
		ИмяПроекта + "/" + МенеджерРепозиторияПроекта.КаталогИсходников() + "/",
		МенеджерРепозиторияПроекта.КаталогИсходников() + "/");

	Возврат ПутьКФайлу;

КонецФункции

// Возвращает сведения об измененном исходнике (*.bsl, *.form и т.д.).
//
// Возвращаемое значение:
// 	Структура:
// 		* Путь - Строка - Относительный путь к измененному исходнику как его отдаёт git
//	 	* Удален - Булево - Признак удаления файла
//
Функция НовыеСведенияОбИсходнике()
	
	Возврат Новый Структура("Путь, Удален", "", Ложь);

КонецФункции

// Возвращает полное имя объекта, получаемое из относительного пути к исходнику,
// где разделитель пути заменен на ".".
// Например,
// 	ПутьКФайлу: "demo83/src/AccountingRegisters/NewРегистрБухгалтерии1/NewРегистрБухгалтерии1.mdo"
// 	Результат: "AccountingRegisters.NewРегистрБухгалтерии1"
//
// Параметры:
// 	ПутьКФайлу - Строка - Относительный путь к файлу метаданных mdo.
//
// Возвращаемое значение:
// 	Строка - например, "AccountingRegisters.NewРегистрБухгалтерии1"
//
Функция ПутьКФайлуВИмяОбъекта(Знач ПутьКФайлу)
	
	БазовыйПуть = ИмяПроекта + "/" + МенеджерРепозиторияПроекта.КаталогИсходников() + "/";
	ПутьКФайлу = УдалитьБазовыйПуть(ПутьКФайлу, БазовыйПуть);

	ЧастиПути = СтрРазделить(ПутьКФайлу, "/");
	ЧастиПути.Удалить(ЧастиПути.ВГраница()); // удалить файл из пути

	ИмяОбъекта = СтрСоединить(ЧастиПути, ".");

	Возврат ИмяОбъекта;

КонецФункции

Функция УдалитьБазовыйПуть(ПутьКФайлу, БазовыйПуть)
	
	ОтносительныйПуть = СтрЗаменить(ПутьКФайлу, ПолучитьРазделительПути(), "/");

	НачалоПути = СтрНайти(ОтносительныйПуть, БазовыйПуть) - 1;
	ДлинаБазовогоПути = НачалоПути + СтрДлина(БазовыйПуть);

	Возврат Прав(ОтносительныйПуть, СтрДлина(ОтносительныйПуть) - ДлинаБазовогоПути);

КонецФункции

// Возвращает пути к файлам метаданных mdo в соответствии с измененными исходниками
// (включая *.bsl,*.form,*.mxlx и т.д.). Собираются все найденные файлы mdo по пути
// от корневой папки объекта-владельца и до измененного файла.
// Например, для исходника
//  "src/ExternalDataSources/NewВнешнийИсточникДанных1/Cubes/NewКуб1/DimensionTables
//  	/NewТаблицаИзмерения1/ManagerModule.bsl"
// будут найдены файлы mdo: NewВнешнийИсточникДанных1.mdo, NewКуб1.mdo, NewТаблицаИзмерения1.mdo.
// Вся эта цепочка файлов mdo предоставляет полную информацию (имена/идентификаторы) об объекте
// для корректного заполнения файла настроек слияния.
//
// Параметры:
// 	СведенияОбИсходниках - Массив Из Структура - См. НовыеСведенияОбИсходнике
// 	КоммитПредка - Строка - Идентификатор исходного родительского git-коммита
//
// Возвращаемое значение:
// 	Массив Из Структура - См. НовыеСведенияОФайлеМетаданных
//
Функция ФайлыМетаданныхПоИсходникам(СведенияОбИсходниках, КоммитПредка)
	
	ФайлыМетаданных = Новый Массив;

	Для каждого СведенияОФайле Из СведенияОбИсходниках Цикл

		ПутьКФайлу = СведенияОФайле.Путь;

		СобратьВсеФайлыМетаданныхПоПутиКИсходнику(ПутьКФайлу, ФайлыМетаданных);

		УдаленФайлМетаданных = СведенияОФайле.Удален И СтрЗаканчиваетсяНа(ПутьКФайлу, ".mdo");
		Если УдаленФайлМетаданных Тогда
			ИсходныеСведения = СведенияОбИсходномФайлеМетаданных(ПутьКФайлу, КоммитПредка, УдаленФайлМетаданных);
			ФайлыМетаданных.Добавить(ИсходныеСведения);
		КонецЕсли;

	КонецЦикла;

	Возврат ФайлыМетаданных;

КонецФункции

Функция СведенияОбИсходномФайлеМетаданных(ПутьКФайлу, КоммитПредка, ФайлУдален = Ложь)

	ФайлМетаданных = ИсходнаяВерсияФайла(ПутьКФайлу, КоммитПредка);

	СведенияОФайле = НовыеСведенияОФайлеМетаданных();
	СведенияОФайле.СтарыйПуть = ПутьКФайлу;
	СведенияОФайле.Путь = ФайлМетаданных.ПолноеИмя;
	СведенияОФайле.Удален = ФайлУдален;

	Возврат СведенияОФайле;

КонецФункции

Процедура СобратьВсеФайлыМетаданныхПоПутиКИсходнику(ПутьКФайлу, ФайлыМетаданных)
	
	НайденныеФайлы = НайтиФайлыМетаданных(ПутьКФайлу);

	Для каждого ФайлМетаданных Из НайденныеФайлы Цикл

		Если ФайлМетаданныхДобавлен(ФайлМетаданных, ФайлыМетаданных) Тогда
			Продолжить;
		КонецЕсли;

		ФайлМетаданныхПути = НовыеСведенияОФайлеМетаданных();
		ФайлМетаданныхПути.СтарыйПуть = ФайлМетаданных.ПолноеИмя;
		ФайлМетаданныхПути.Путь = ФайлМетаданных.ПолноеИмя;

		ФайлыМетаданных.Добавить(ФайлМетаданныхПути);

	КонецЦикла;

КонецПроцедуры

Функция ФайлМетаданныхДобавлен(ФайлМетаданных, ФайлыМетаданных)
	
	ФайлДобавлен = Ложь;

	Для каждого ПутиКФайлу Из ФайлыМетаданных Цикл

		Если ПутиКФайлу.Путь = ФайлМетаданных.ПолноеИмя Тогда
			ФайлДобавлен = Истина;
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат ФайлДобавлен;

КонецФункции

// Возвращает все найденные файлы метаданных mdo, описывающих объект метаданных конфигурации,
// один из исходников (*.bsl, *.form и т.д.) которого был изменен. Собираются все файлы mdo
// по пути от корневого каталога объекта-владельца и до измененного исходника.
//
// Параметры:
// 	ПутьКФайлу - Строка - Относительный путь к измененному файлу
//
// Возвращаемое значение:
//  Массив Из Файл - Массив найденных файлов mdo
//
Функция НайтиФайлыМетаданных(ПутьКФайлу)

	ПолноеИмяОбъекта = ПутьКФайлуВИмяОбъекта(ПутьКФайлу);

	ЧастиИмени = СтрРазделить(ПолноеИмяОбъекта, ".");
	ЧастиИмени.Вставить(0, МенеджерРепозиторияПроекта.КаталогИсходников());

	ТекущийУровеньВложенности = ЧастиИмени.ВГраница();

	// предельный уровень, до которого поднимаемся в поисках mdo
	// например, src/ExchangePlans/NewПланОбмена1
	УровеньОбъектаВладельца = 2;
	Если ПолноеИмяОбъекта = "Configuration" Тогда
		УровеньОбъектаВладельца = 1;
	КонецЕсли;

	ФайлыМетаданных = Новый Массив;

	Пока ТекущийУровеньВложенности >= УровеньОбъектаВладельца Цикл
		
		ОбластьПоиска = СтрСоединить(ЧастиИмени, "/");
		Файлы = НайтиФайлы(ОбластьПоиска, "*.mdo");

		Если Файлы.Количество() Тогда
			ФайлыМетаданных.Добавить(Файлы[0]);
		КонецЕсли;

		ЧастиИмени.Удалить(ТекущийУровеньВложенности);
		ТекущийУровеньВложенности = ЧастиИмени.ВГраница();

	КонецЦикла;

	Возврат ФайлыМетаданных;

КонецФункции

// Возвращает новые сведения о файле метаданных.
//
// Возвращаемое значение:
// 	Структура:
// 		* СтарыйПуть - Строка - Путь к прежнему файлу, как он был до изменения.
//		* Путь - Строка - Путь к текущему файлу. Либо это прежний путь,
//				либо путь к временному файлу, в котором восстановлен удаленный файл mdo.
//		* Удален - Булево - Признак удаления файла, на который указывает СтарыйПуть.
//
Функция НовыеСведенияОФайлеМетаданных()
	
	Возврат Новый Структура("СтарыйПуть, Путь, Удален", "", "", Ложь);

КонецФункции

// Возвращает исходное состояние удаленного файла.
//
// Параметры:
// 	ПутьКФайлу - Строка - Относительный путь к файлу исходника, который выдает git с пометкой удаленного (D).
// 	КоммитИсходногоСостоянияФайла - Строка - Идентификатор родительского коммита,
// 											 в котором удаленный файл ещё существовал.
//
// Возвращаемое значение:
// 	Файл - Файл с восстановленным содержанием удаленного файла.
//
Функция ИсходнаяВерсияФайла(ПутьКФайлу, КоммитИсходногоСостоянияФайла)

	ИсходноеСодержание = МенеджерРепозиторияПроекта.ИсходноеСодержаниеФайла(
		ПутьКФайлу, КоммитИсходногоСостоянияФайла);

	ПутьКВременномуФайлу = ВременныеФайлы.НовоеИмяФайла("mdo");

	ЗаписьТекста = Новый ЗаписьТекста(ПутьКВременномуФайлу);
	ЗаписьТекста.Записать(ИсходноеСодержание);
	ЗаписьТекста.Закрыть();

	ИсходнаяВерсия = Новый Файл(ПутьКВременномуФайлу);

	Возврат ИсходнаяВерсия;

КонецФункции

// Возвращает имя и идентификатор объекта и идентификаторы его подчиненных объектов,
// прочитанных из файла метаданных mdo.
//
// Параметры:
// 	ПутьКФайлу - Строка - Путь к файлу метаданных mdo
//
// Возвращаемое значение:
// 	Структура:
//		* Имя - Имя объекта метаданных
//		* Идентификатор - Идентификатор объекта метаданных
//		* ПодчиненныеОбъекты - Массив Из Структура:
//			* Имя - Имя подчиненного объекта
//			* Идентификатор - Идентификатор подчиненного объекта
//
Функция ПрочитатьМетаданныеОбъекта(Знач ПутьКФайлу)
	
	ОписаниеОбъекта = Новый Структура;
	ОписаниеОбъекта.Вставить("Имя", "");
	ОписаниеОбъекта.Вставить("Идентификатор", "");
	ОписаниеОбъекта.Вставить("ПодчиненныеОбъекты", Новый Массив);

	ПутьКФайлу = УдалитьПроектИзПути(ПутьКФайлу);
	РезультатЧтения = ПроцессорXML().ПрочитатьИзФайла(ПутьКФайлу);

	КорневойЭлемент = Неопределено;
	Для каждого Узел Из РезультатЧтения Цикл
		КорневойЭлемент = Узел;
	КонецЦикла;

	Атрибуты = КорневойЭлемент.Значение._Атрибуты;
	Элементы = ЗначениеВМассив(КорневойЭлемент.Значение._Элементы);

	Для каждого Элемент Из Элементы Цикл

		Для каждого Свойство Из Элемент Цикл

			ИмяСвойства = Свойство.Ключ;
			ЗначениеСвойства = Свойство.Значение;

			Если ИмяСвойства = "name" Тогда
				ОписаниеОбъекта.Имя = ЗначениеСвойства;
				ОписаниеОбъекта.Идентификатор = Атрибуты["uuid"];
			КонецЕсли;

			Если ТипЗнч(ЗначениеСвойства) = Тип("Структура")
				И ЗначениеСвойства.Свойство("_Атрибуты")
				И ЗначениеСвойства.Свойство("_Элементы") Тогда
				
				ДобавитьПодчиненныеОбъекты(ОписаниеОбъекта.ПодчиненныеОбъекты,
					ИмяСвойства, ЗначениеСвойства);

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Возврат ОписаниеОбъекта;

КонецФункции

Процедура ДобавитьПодчиненныеОбъекты(ПодчиненныеОбъекты, ИмяСвойства, ЗначениеСвойства)
	
	Атрибуты = ЗначениеСвойства["_Атрибуты"];
	Элементы = ЗначениеСвойства["_Элементы"];

	ЭлементыСвойства = ЗначениеВМассив(Элементы);

	Для каждого Элемент Из ЭлементыСвойства Цикл

		Если Элемент["name"] = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ИмяПодчиненногоСборка = Новый Массив;
		ИмяПодчиненногоСборка.Добавить(ИмяСвойства);
		ИмяПодчиненногоСборка.Добавить(Элемент["name"]);
		
		ИмяПодчиненного = СтрСоединить(ИмяПодчиненногоСборка, ".");
		ИдентификаторПодчиненного = Атрибуты["uuid"];

		НовыйПодчиненныйОбъект = Новый Структура;
		НовыйПодчиненныйОбъект.Вставить("Имя", ИмяПодчиненного);
		НовыйПодчиненныйОбъект.Вставить("Идентификатор", ИдентификаторПодчиненного);

		ПодчиненныеОбъекты.Добавить(НовыйПодчиненныйОбъект);

	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьВТаблицуМетаданныхEDT(ОписаниеОбъекта, ТаблицаМетаданных, ПолноеИмяОбъекта)

	ДобавитьНовуюСтрокуВТаблицуМетаданныхEDT(ТаблицаМетаданных,
		ОписаниеОбъекта.Идентификатор, ПолноеИмяОбъекта);
	
	Для каждого Подчиненный Из ОписаниеОбъекта.ПодчиненныеОбъекты Цикл
		
		ПолноеИмяПодчиненного = ПолноеИмяОбъекта + "." + Подчиненный.Имя;
		Если ПолноеИмяОбъекта = "Configuration" Тогда
			ПолноеИмяПодчиненного = Подчиненный.Имя;
		КонецЕсли;

		ДобавитьНовуюСтрокуВТаблицуМетаданныхEDT(ТаблицаМетаданных,
			Подчиненный.Идентификатор, ПолноеИмяПодчиненного);

	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьНовуюСтрокуВТаблицуМетаданныхEDT(ТаблицаМетаданных, ИдентификаторОбъекта, ПолноеИмяОбъекта)
	
	Если НЕ ИдентификаторДобавленВТаблицу(ИдентификаторОбъекта, ТаблицаМетаданных) Тогда

		СтрокаТаблицыМетаданных = ТаблицаМетаданных.Добавить();
		СтрокаТаблицыМетаданных.ИдентификаторОбъекта = ИдентификаторОбъекта;
		СтрокаТаблицыМетаданных.ПолноеИмяОбъекта = ПолноеИмяОбъекта;

	КонецЕсли;

КонецПроцедуры

// Возвращает таблицу измененных объектов V8.
//
// Параметры:
// 	ТаблицаМетаданныхEDT - ТаблицаЗначений - См. НоваяТаблицаМетаданныхEDT.
// 	ТаблицаМетаданныхV8 - ТаблицаЗначений - См. НоваяТаблицаМетаданныхV8.
//
// Возвращаемое значение:
// 	ТаблицаЗначений - См. НоваяТаблицаИзмененныхОбъектовV8
//
Функция СоздатьТаблицуИзмененныхОбъектовV8(ТаблицаМетаданныхEDT, ТаблицаМетаданныхV8)
	
	ТаблицаИзмененныхОбъектовV8 = НоваяТаблицаИзмененныхОбъектовV8();

	Для каждого ОписаниеОбъекта Из ТаблицаМетаданныхEDT Цикл

		ИдентификаторОбъекта = ОписаниеОбъекта.ИдентификаторОбъекта;

		Если ИдентификаторДобавленВТаблицу(ИдентификаторОбъекта, ТаблицаИзмененныхОбъектовV8) Тогда
			Продолжить;
		КонецЕсли;

		ОписаниеОбъектаV8 = ТаблицаМетаданныхV8.Найти(ИдентификаторОбъекта, "ИдентификаторОбъекта");

		ЭтоНовыйОбъектМетаданных = ОписаниеОбъектаV8 = Неопределено;
		ЭтоОписаниеКонфигурации = ОписаниеОбъектаV8 <> Неопределено
			И СтрНачинаетсяС(ОписаниеОбъектаV8.ПолноеИмяОбъекта, "Configuration.");

		Если ЭтоНовыйОбъектМетаданных ИЛИ ЭтоОписаниеКонфигурации Тогда
			Продолжить;
		КонецЕсли;

		ДобавитьВТаблицуИзмененныхОбъектовV8(ТаблицаИзмененныхОбъектовV8, ОписаниеОбъекта, ОписаниеОбъектаV8);

	КонецЦикла;

	Возврат ТаблицаИзмененныхОбъектовV8;

КонецФункции

// Возвращает пустую таблицу измененных объектов V8.
// 
// Возвращаемое значение:
// 	ТаблицаЗначений:
// 	 * ИдентификаторОбъекта - Строка - Идентификатор объекта метаданных конфигурации
// 	 * ПолноеИмяОбъекта - Строка - полное имя объекта, до изменения, например ExchangePlan.NewПланОбмена1
// 	 * ПолноеИмяОбъектаНовое - Строка - полное имя объекта, измененное, например ExchangePlan.NewПланОбмена111
// 	 * ВладелецОбъекта - Строка - Полное имя объекта, являющегося владельцем подчиненного объекта,
// 								  например ExchangePlan.NewПланОбмена1.
// 								  Имеет преимущество перед свойством ПолноеИмяОбъекта для попадания в
// 								  список объектов для последующего захвата в хранилище.
//								  Например, была изменена команда (тип Command), сам объект Команда
// 								  захватить в хранилище нельзя (в отличие от формы/макета), ВладелецОбъекта 
//								  предоставляет полное имя объекта, который необходимо захватить
//								  для разблокировки подчиненного объекта Команда.
//
Функция НоваяТаблицаИзмененныхОбъектовV8()
	
	ТаблицаИзмененныхОбъектовV8 = Новый ТаблицаЗначений;
	ТаблицаИзмененныхОбъектовV8.Колонки.Добавить("ИдентификаторОбъекта");
	ТаблицаИзмененныхОбъектовV8.Колонки.Добавить("ПолноеИмяОбъекта");
	ТаблицаИзмененныхОбъектовV8.Колонки.Добавить("ПолноеИмяОбъектаНовое");
	ТаблицаИзмененныхОбъектовV8.Колонки.Добавить("ВладелецОбъекта");

	Возврат ТаблицаИзмененныхОбъектовV8;

КонецФункции

Процедура ДобавитьВТаблицуИзмененныхОбъектовV8(ТаблицаИзмененныхОбъектовV8, ОписаниеОбъекта, ОписаниеОбъектаV8)
	
	НоваяСтрока = ТаблицаИзмененныхОбъектовV8.Добавить();
	НоваяСтрока.ПолноеИмяОбъекта = ОписаниеОбъектаV8.ПолноеИмяОбъекта;
	НоваяСтрока.ПолноеИмяОбъектаНовое = ПривестиИмяОбъектаКВидуV8(
		ОписаниеОбъекта.ПолноеИмяОбъекта, ОписаниеОбъектаV8.ПолноеИмяОбъекта); 
	НоваяСтрока.ИдентификаторОбъекта = ОписаниеОбъекта.ИдентификаторОбъекта;
	НоваяСтрока.ВладелецОбъекта = ОписаниеОбъектаV8.ВладелецОбъекта;

КонецПроцедуры

// Возвращает полное имя объекта в представлении пространства имен V8.
// Например,
// 	ИмяОбъекта = "ExchangePlans.NewПланОбмена1.Forms.NewФормаУзла1";
// 	ИмяОбъектаV8 = "ExchangePlan.NewПланОбмена.Form.NewФормаУзла";
// 	Результат = ExchangePlan.NewПланОбмена1.Form.NewФормаУзла1
//
// Параметры:
// 	ИмяОбъекта - Строка - Полное имя объекта EDT
// 	ИмяОбъектаV8 - Строка - Полное имя объекта V8
//
// Возвращаемое значение:
// 	Строка
//
Функция ПривестиИмяОбъектаКВидуV8(Знач ИмяОбъекта, Знач ИмяОбъектаV8)
	
	ЧастиИмениОбъекта = СтрРазделить(ИмяОбъекта, ".");

	ЧастиИмениОбъектаV8 = СтрРазделить(ИмяОбъектаV8, ".");

	НормализованноеИмяСборка = Новый Массив;

	Для Индекс = 0 По ЧастиИмениОбъекта.ВГраница() Цикл

		ЧетныйСегмент = Индекс % 2 = 0; // BSLLS:MagicNumber-off
		Если ЧетныйСегмент Тогда
			ТипОбъекта = ЧастиИмениОбъектаV8[Индекс];
			НормализованноеИмяСборка.Добавить(ТипОбъекта);
		Иначе
			ИмяОбъекта = ЧастиИмениОбъекта[Индекс];
			НормализованноеИмяСборка.Добавить(ИмяОбъекта);
		КонецЕсли;

	КонецЦикла;

	Возврат СтрСоединить(НормализованноеИмяСборка, ".");

КонецФункции

Функция ЗначениеВМассив(Значение)
	
	ЗначениеВМассиве = Значение;

	Если ТипЗнч(ЗначениеВМассиве) <> Тип("Массив") Тогда
		ЗначениеВМассиве = Новый Массив;
		ЗначениеВМассиве.Добавить(Значение);
	КонецЕсли;

	Возврат ЗначениеВМассиве;

КонецФункции

#КонецОбласти

#КонецОбласти