#Использовать "./internal/tool1cd"
#Использовать fs

Перем _НастройкиХранилища; // Настройки подключения к хранилищу конфигурации

&Желудь
Процедура ПриСозданииОбъекта(
	&Деталька("Хранилище") НастройкиХранилища)

	_НастройкиХранилища = НастройкиХранилища;

КонецПроцедуры

Функция ТекущаяВерсияХранилища() Экспорт

	Если НЕ ЗначениеЗаполнено(_НастройкиХранилища) Тогда
		ВызватьИсключение "Не переданы настройки хранилища";
	КонецЕсли;

	КаталогХранилища = ФС.ПолныйПуть(_НастройкиХранилища["Путь"]);
	ФайлХранилища = ОбъединитьПути(КаталогХранилища, "1cv8ddb.1CD");

	ЧтениеБазыДанных = Новый ЧтениеТаблицФайловойБазыДанных;
	ЧтениеБазыДанных.ОткрытьФайл(ФайлХранилища);

	Попытка
		ТаблицаХранилища = ЧтениеБазыДанных.ПрочитатьТаблицу("VERSIONS");
		ТаблицаХранилища.Колонки.Добавить("Версия", Новый ОписаниеТипов("Число"));
		Для Каждого СтрокаТаблицы Из ТаблицаХранилища Цикл
			СтрокаТаблицы.Версия = СтрокаТаблицы.VERNUM;
		КонецЦикла;
	Исключение
		ЧтениеБазыДанных.ЗакрытьФайл();
		ВызватьИсключение;
	КонецПопытки;

	ЧтениеБазыДанных.ЗакрытьФайл();

	ТаблицаХранилища.Сортировать("Версия Убыв");
	
	ТекущаяВерсия = 0;
	Если ТаблицаХранилища.Количество() Тогда
		ТекущаяВерсия = ТаблицаХранилища[0].Версия;
	КонецЕсли;

	Возврат ТекущаяВерсия;

КонецФункции