#Использовать "./internal/tool1cd"
#Использовать fs

Перем _ПутьКХранилищу; // Путь к каталогу хранилища конфигурации

Процедура ПриСозданииОбъекта(ПутьКХранилищу)

	_ПутьКХранилищу = ПутьКХранилищу;

КонецПроцедуры

Функция ТекущаяВерсияХранилища() Экспорт

	Если НЕ ЗначениеЗаполнено(_ПутьКХранилищу) Тогда
		ВызватьИсключение "Не указан путь к каталогу хранилища";
	КонецЕсли;

	КаталогХранилища = ФС.ПолныйПуть(_ПутьКХранилищу);
	ФайлХранилища = ОбъединитьПути(КаталогХранилища, "1cv8ddb.1CD");

	ЧтениеБазыДанных = Новый ЧтениеТаблицФайловойБазыДанных;
	ЧтениеБазыДанных.ОткрытьФайл(ФайлХранилища);

	Попытка
		ТаблицаХранилища = ЧтениеБазыДанных.ПрочитатьТаблицу("VERSIONS");
		ТаблицаХранилища.Колонки.Добавить("Версия", Новый ОписаниеТипов("Число"));
		Для Каждого СтрокаТаблицы Из ТаблицаХранилища Цикл
			СтрокаТаблицы.Версия = СтрокаТаблицы.VERNUM;
		КонецЦикла;
	Исключение
		ЧтениеБазыДанных.ЗакрытьФайл();
		ВызватьИсключение;
	КонецПопытки;

	ЧтениеБазыДанных.ЗакрытьФайл();

	ТаблицаХранилища.Сортировать("Версия Убыв");
	
	ТекущаяВерсия = 0;
	Если ТаблицаХранилища.Количество() Тогда
		ТекущаяВерсия = ТаблицаХранилища[0].Версия;
	КонецЕсли;

	Возврат ТекущаяВерсия;

КонецФункции